henri-32/esp32-tiller-autopilot/.pio-core/platforms/ststm32/misc/svd/STM32MP153x.svd
        <register>
          <name>DDRCTRL_SWCTL</name>
          <displayName>DDRCTRL_SWCTL</displayName>
          <description>DDRCTRL software register programming control enable</description>
          <addressOffset>0x320</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>SW_DONE</name>
              <description>SW_DONE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DDRCTRL_SWSTAT</name>
          <displayName>DDRCTRL_SWSTAT</displayName>
          <description>DDRCTRL software register programming control status</description>
          <addressOffset>0x324</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>SW_DONE_ACK</name>
              <description>SW_DONE_ACK</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DDRCTRL_POISONCFG</name>
          <displayName>DDRCTRL_POISONCFG</displayName>
          <description>AXI Poison configuration register common for all AXI ports.</description>
          <addressOffset>0x36C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00110011</resetValue>
          <fields>
            <field>
              <name>WR_POISON_SLVERR_EN</name>
              <description>WR_POISON_SLVERR_EN</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WR_POISON_INTR_EN</name>
              <description>WR_POISON_INTR_EN</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WR_POISON_INTR_CLR</name>
              <description>WR_POISON_INTR_CLR</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RD_POISON_SLVERR_EN</name>
              <description>RD_POISON_SLVERR_EN</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RD_POISON_INTR_EN</name>
              <description>RD_POISON_INTR_EN</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RD_POISON_INTR_CLR</name>
              <description>RD_POISON_INTR_CLR</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DDRCTRL_POISONSTAT</name>
          <displayName>DDRCTRL_POISONSTAT</displayName>
          <description>DDRCTRL AXI Poison status register</description>
          <addressOffset>0x370</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>WR_POISON_INTR_0</name>
              <description>WR_POISON_INTR_0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WR_POISON_INTR_1</name>
              <description>WR_POISON_INTR_1</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RD_POISON_INTR_0</name>
              <description>RD_POISON_INTR_0</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RD_POISON_INTR_1</name>
              <description>RD_POISON_INTR_1</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DDRCTRL_PSTAT</name>
          <displayName>DDRCTRL_PSTAT</displayName>
          <description>DDRCTRL port status register</description>
          <addressOffset>0x3FC</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RD_PORT_BUSY_0</name>
              <description>RD_PORT_BUSY_0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RD_PORT_BUSY_1</name>
              <description>RD_PORT_BUSY_1</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WR_PORT_BUSY_0</name>
              <description>WR_PORT_BUSY_0</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WR_PORT_BUSY_1</name>
              <description>WR_PORT_BUSY_1</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DDRCTRL_PCCFG</name>
          <displayName>DDRCTRL_PCCFG</displayName>
          <description>DDRCTRL port common configuration register</description>
          <addressOffset>0x400</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>GO2CRITICAL_EN</name>
              <description>GO2CRITICAL_EN</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PAGEMATCH_LIMIT</name>
              <description>PAGEMATCH_LIMIT</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BL_EXP_MODE</name>
              <description>BL_EXP_MODE</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DDRCTRL_PCFGR_0</name>
          <displayName>DDRCTRL_PCFGR_0</displayName>
          <description>DDRCTRL port 0 configuration read register</description>
          <addressOffset>0x404</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00004000</resetValue>
          <fields>
            <field>
              <name>RD_PORT_PRIORITY</name>
              <description>RD_PORT_PRIORITY</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
            </field>
            <field>
              <name>RD_PORT_AGING_EN</name>
              <description>RD_PORT_AGING_EN</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RD_PORT_URGENT_EN</name>
              <description>RD_PORT_URGENT_EN</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RD_PORT_PAGEMATCH_EN</name>
              <description>RD_PORT_PAGEMATCH_EN</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RDWR_ORDERED_EN</name>
              <description>RDWR_ORDERED_EN</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DDRCTRL_PCFGW_0</name>
          <displayName>DDRCTRL_PCFGW_0</displayName>
          <description>DDRCTRL port 0 configuration write register</description>
          <addressOffset>0x408</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00004000</resetValue>
          <fields>
            <field>
              <name>WR_PORT_PRIORITY</name>
              <description>WR_PORT_PRIORITY</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
            </field>
            <field>
              <name>WR_PORT_AGING_EN</name>
              <description>WR_PORT_AGING_EN</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WR_PORT_URGENT_EN</name>
              <description>WR_PORT_URGENT_EN</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WR_PORT_PAGEMATCH_EN</name>
              <description>WR_PORT_PAGEMATCH_EN</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DDRCTRL_PCTRL_0</name>
          <displayName>DDRCTRL_PCTRL_0</displayName>
          <description>DDRCTRL port 0 control register</description>
          <addressOffset>0x490</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PORT_EN</name>
              <description>PORT_EN</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DDRCTRL_PCFGQOS0_0</name>
          <displayName>DDRCTRL_PCFGQOS0_0</displayName>
          <description>DDRCTRL port 0 read Q0S configuration register 0</description>
          <addressOffset>0x494</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x02000E00</resetValue>
          <fields>
            <field>
              <name>RQOS_MAP_LEVEL1</name>
              <description>RQOS_MAP_LEVEL1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>RQOS_MAP_LEVEL2</name>
              <description>RQOS_MAP_LEVEL2</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>RQOS_MAP_REGION0</name>
              <description>RQOS_MAP_REGION0</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>RQOS_MAP_REGION1</name>
              <description>RQOS_MAP_REGION1</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>RQOS_MAP_REGION2</name>
              <description>RQOS_MAP_REGION2</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DDRCTRL_PCFGQOS1_0</name>
          <displayName>DDRCTRL_PCFGQOS1_0</displayName>
          <description>DDRCTRL port 0 read Q0S configuration register 1</description>
          <addressOffset>0x498</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RQOS_MAP_TIMEOUTB</name>
              <description>RQOS_MAP_TIMEOUTB</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
            </field>
            <field>
              <name>RQOS_MAP_TIMEOUTR</name>
              <description>RQOS_MAP_TIMEOUTR</description>
              <bitOffset>16</bitOffset>
              <bitWidth>11</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DDRCTRL_PCFGWQOS0_0</name>
          <displayName>DDRCTRL_PCFGWQOS0_0</displayName>
          <description>DDRCTRL port 0 write Q0S configuration register 0</description>
          <addressOffset>0x49C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000E00</resetValue>
          <fields>
            <field>
              <name>WQOS_MAP_LEVEL1</name>
              <description>WQOS_MAP_LEVEL1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>WQOS_MAP_LEVEL2</name>
              <description>WQOS_MAP_LEVEL2</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>WQOS_MAP_REGION0</name>
              <description>WQOS_MAP_REGION0</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>WQOS_MAP_REGION1</name>
              <description>WQOS_MAP_REGION1</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>WQOS_MAP_REGION2</name>
              <description>WQOS_MAP_REGION2</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DDRCTRL_PCFGWQOS1_0</name>
          <displayName>DDRCTRL_PCFGWQOS1_0</displayName>
          <description>DDRCTRL port 0 write Q0S configuration register 1</description>
          <addressOffset>0x4A0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>WQOS_MAP_TIMEOUT1</name>
              <description>WQOS_MAP_TIMEOUT1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
            </field>
            <field>
              <name>WQOS_MAP_TIMEOUT2</name>
              <description>WQOS_MAP_TIMEOUT2</description>
              <bitOffset>16</bitOffset>
              <bitWidth>11</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DDRCTRL_PCFGR_1</name>
          <displayName>DDRCTRL_PCFGR_1</displayName>
          <description>DDRCTRL port 1 configuration read register</description>
          <addressOffset>0x4B4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00004000</resetValue>
          <fields>
            <field>
              <name>RD_PORT_PRIORITY</name>
              <description>RD_PORT_PRIORITY</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
            </field>
            <field>
              <name>RD_PORT_AGING_EN</name>
              <description>RD_PORT_AGING_EN</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RD_PORT_URGENT_EN</name>
              <description>RD_PORT_URGENT_EN</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RD_PORT_PAGEMATCH_EN</name>
              <description>RD_PORT_PAGEMATCH_EN</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RDWR_ORDERED_EN</name>
              <description>RDWR_ORDERED_EN</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DDRCTRL_PCFGW_1</name>
          <displayName>DDRCTRL_PCFGW_1</displayName>
          <description>DDRCTRL port 1 configuration write register</description>
          <addressOffset>0x4B8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00004000</resetValue>
          <fields>
            <field>
              <name>WR_PORT_PRIORITY</name>
              <description>WR_PORT_PRIORITY</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
            </field>
            <field>
              <name>WR_PORT_AGING_EN</name>
              <description>WR_PORT_AGING_EN</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WR_PORT_URGENT_EN</name>
              <description>WR_PORT_URGENT_EN</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WR_PORT_PAGEMATCH_EN</name>
              <description>WR_PORT_PAGEMATCH_EN</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DDRCTRL_PCTRL_1</name>
          <displayName>DDRCTRL_PCTRL_1</displayName>
          <description>DDRCTRL port 1 control register</description>
          <addressOffset>0x540</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PORT_EN</name>
              <description>PORT_EN</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DDRCTRL_PCFGQOS0_1</name>
          <displayName>DDRCTRL_PCFGQOS0_1</displayName>
          <description>DDRCTRL port 1 read Q0S configuration register 0</description>
          <addressOffset>0x544</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x02000E00</resetValue>
          <fields>
            <field>
              <name>RQOS_MAP_LEVEL1</name>
              <description>RQOS_MAP_LEVEL1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>RQOS_MAP_LEVEL2</name>
              <description>RQOS_MAP_LEVEL2</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>RQOS_MAP_REGION0</name>
              <description>RQOS_MAP_REGION0</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>RQOS_MAP_REGION1</name>
              <description>RQOS_MAP_REGION1</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>RQOS_MAP_REGION2</name>
              <description>RQOS_MAP_REGION2</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DDRCTRL_PCFGQOS1_1</name>
          <displayName>DDRCTRL_PCFGQOS1_1</displayName>
          <description>DDRCTRL port 1 read Q0S configuration register 1</description>
          <addressOffset>0x548</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RQOS_MAP_TIMEOUTB</name>
              <description>RQOS_MAP_TIMEOUTB</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
            </field>
            <field>
              <name>RQOS_MAP_TIMEOUTR</name>
              <description>RQOS_MAP_TIMEOUTR</description>
              <bitOffset>16</bitOffset>
              <bitWidth>11</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DDRCTRL_PCFGWQOS0_1</name>
          <displayName>DDRCTRL_PCFGWQOS0_1</displayName>
          <description>DDRCTRL port 1 write Q0S configuration register 0</description>
          <addressOffset>0x54C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000E00</resetValue>
          <fields>
            <field>
              <name>WQOS_MAP_LEVEL1</name>
              <description>WQOS_MAP_LEVEL1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>WQOS_MAP_LEVEL2</name>
              <description>WQOS_MAP_LEVEL2</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>WQOS_MAP_REGION0</name>
              <description>WQOS_MAP_REGION0</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>WQOS_MAP_REGION1</name>
              <description>WQOS_MAP_REGION1</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>WQOS_MAP_REGION2</name>
              <description>WQOS_MAP_REGION2</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DDRCTRL_PCFGWQOS1_1</name>
          <displayName>DDRCTRL_PCFGWQOS1_1</displayName>
          <description>DDRCTRL port 1 write Q0S configuration register 1</description>
          <addressOffset>0x550</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>WQOS_MAP_TIMEOUT1</name>
              <description>WQOS_MAP_TIMEOUT1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
            </field>
            <field>
              <name>WQOS_MAP_TIMEOUT2</name>
              <description>WQOS_MAP_TIMEOUT2</description>
              <bitOffset>16</bitOffset>
              <bitWidth>11</bitWidth>
            </field>
          </fields>
        </register>
