henri-32/esp32-tiller-autopilot/.pio-core/platforms/ststm32/misc/svd/STM32MP153x.svd
        <register>
          <name>DDRPHYC_DXCCR</name>
          <displayName>DDRPHYC_DXCCR</displayName>
          <description>DDRPHYC DXCC register</description>
          <addressOffset>0x28</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000800</resetValue>
          <fields>
            <field>
              <name>DXODT</name>
              <description>DXODT</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DXIOM</name>
              <description>DXIOM</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DXPDD</name>
              <description>DXPDD</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DXPDR</name>
              <description>DXPDR</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DQSRES</name>
              <description>DQSRES</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>DQSNRES</name>
              <description>DQSNRES</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>DQSNRST</name>
              <description>DQSNRST</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RVSEL</name>
              <description>RVSEL</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AWDT</name>
              <description>AWDT</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DDRPHYC_DSGCR</name>
          <displayName>DDRPHYC_DSGCR</displayName>
          <description>DDRPHYC DSGC register</description>
          <addressOffset>0x2C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0xFA00001F</resetValue>
          <fields>
            <field>
              <name>PUREN</name>
              <description>PUREN</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BDISEN</name>
              <description>BDISEN</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ZUEN</name>
              <description>ZUEN</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LPIOPD</name>
              <description>LPIOPD</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LPDLLPD</name>
              <description>LPDLLPD</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DQSGX</name>
              <description>DQSGX</description>
              <bitOffset>5</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>DQSGE</name>
              <description>DQSGE</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>NOBUB</name>
              <description>NOBUB</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FXDLAT</name>
              <description>FXDLAT</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CKEPDD</name>
              <description>CKEPDD</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ODTPDD</name>
              <description>ODTPDD</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>NL2PD</name>
              <description>NL2PD</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>NL2OE</name>
              <description>NL2OE</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TPDPD</name>
              <description>TPDPD</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TPDOE</name>
              <description>TPDOE</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CKOE</name>
              <description>CKOE</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ODTOE</name>
              <description>ODTOE</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RSTOE</name>
              <description>RSTOE</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CKEOE</name>
              <description>CKEOE</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DDRPHYC_DCR</name>
          <displayName>DDRPHYC_DCR</displayName>
          <description>DDRPHYC DC register</description>
          <addressOffset>0x30</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000000B</resetValue>
          <fields>
            <field>
              <name>DDRMD</name>
              <description>DDRMD</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>DDR8BNK</name>
              <description>DDR8BNK</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PDQ</name>
              <description>PDQ</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>MPRDQ</name>
              <description>MPRDQ</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DDRTYPE</name>
              <description>DDRTYPE</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>NOSRA</name>
              <description>NOSRA</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DDR2T</name>
              <description>DDR2T</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>UDIMM</name>
              <description>UDIMM</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RDIMM</name>
              <description>RDIMM</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TPD</name>
              <description>TPD</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DDRPHYC_DTPR0</name>
          <displayName>DDRPHYC_DTPR0</displayName>
          <description>DDRPHYC DTP register 0</description>
          <addressOffset>0x34</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x3012666E</resetValue>
          <fields>
            <field>
              <name>TMRD</name>
              <description>TMRD</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>TRTP</name>
              <description>TRTP</description>
              <bitOffset>2</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>TWTR</name>
              <description>TWTR</description>
              <bitOffset>5</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>TRP</name>
              <description>TRP</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>TRCD</name>
              <description>TRCD</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>TRAS</name>
              <description>TRAS</description>
              <bitOffset>16</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>TRRD</name>
              <description>TRRD</description>
              <bitOffset>21</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>TRC</name>
              <description>TRC</description>
              <bitOffset>25</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
            <field>
              <name>TCCD</name>
              <description>TCCD</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DDRPHYC_DTPR1</name>
          <displayName>DDRPHYC_DTPR1</displayName>
          <description>DDRPHYC DTP register 1</description>
          <addressOffset>0x38</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0A030090</resetValue>
          <fields>
            <field>
              <name>TAOND</name>
              <description>TAOND</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>TRTW</name>
              <description>TRTW</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TFAW</name>
              <description>TFAW</description>
              <bitOffset>3</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
            <field>
              <name>TMOD</name>
              <description>TMOD</description>
              <bitOffset>9</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>TRTODT</name>
              <description>TRTODT</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TRFC</name>
              <description>TRFC</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>TDQSCKMIN</name>
              <description>TDQSCKMIN</description>
              <bitOffset>24</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>TDQSCKMAX</name>
              <description>TDQSCKMAX</description>
              <bitOffset>27</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DDRPHYC_DTPR2</name>
          <displayName>DDRPHYC_DTPR2</displayName>
          <description>DDRPHYC DTP register 2</description>
          <addressOffset>0x3C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x20040D84</resetValue>
          <fields>
            <field>
              <name>TXS</name>
              <description>TXS</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
            </field>
            <field>
              <name>TXP</name>
              <description>TXP</description>
              <bitOffset>10</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>TCKE</name>
              <description>TCKE</description>
              <bitOffset>15</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>TDLLK</name>
              <description>TDLLK</description>
              <bitOffset>19</bitOffset>
              <bitWidth>10</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DDRPHYC_DDR3_MR0</name>
          <displayName>DDRPHYC_DDR3_MR0</displayName>
          <description>DDRPHYC MR0 register for DDR3</description>
          <addressOffset>0x40</addressOffset>
          <size>0x10</size>
          <access>read-write</access>
          <resetValue>0x00000A52</resetValue>
          <fields>
            <field>
              <name>BL</name>
              <description>BL</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CL0</name>
              <description>CL0</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BT</name>
              <description>BT</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CL</name>
              <description>CL</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>TM</name>
              <description>TM</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DR</name>
              <description>DR</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WR</name>
              <description>WR</description>
              <bitOffset>9</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>PD</name>
              <description>PD</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RSVD</name>
              <description>RSVD</description>
              <bitOffset>13</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DDRPHYC_DDR3_MR1</name>
          <displayName>DDRPHYC_DDR3_MR1</displayName>
          <description>DDRPHYC MR1 register for DDR3</description>
          <addressOffset>0x44</addressOffset>
          <size>0x10</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DE</name>
              <description>DE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DIC0</name>
              <description>DIC0</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RTT0</name>
              <description>RTT0</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AL</name>
              <description>AL</description>
              <bitOffset>3</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>DIC1</name>
              <description>DIC1</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RTT1</name>
              <description>RTT1</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LEVEL</name>
              <description>LEVEL</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RTT2</name>
              <description>RTT2</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TDQS</name>
              <description>TDQS</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>QOFF</name>
              <description>QOFF</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DDRPHYC_DDR3_MR2</name>
          <displayName>DDRPHYC_DDR3_MR2</displayName>
          <description>DDRPHYC MR2 register for DDR3</description>
          <addressOffset>0x48</addressOffset>
          <size>0x10</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PASR</name>
              <description>PASR</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>CWL</name>
              <description>CWL</description>
              <bitOffset>3</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>ASR</name>
              <description>ASR</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SRT</name>
              <description>SRT</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RTTWR</name>
              <description>RTTWR</description>
              <bitOffset>9</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DDRPHYC_DDR3_MR3</name>
          <displayName>DDRPHYC_DDR3_MR3</displayName>
          <description>DDRPHYC MR3 register for DDR3</description>
          <addressOffset>0x4C</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>MPRLOC</name>
              <description>MPRLOC</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>MPR</name>
              <description>MPR</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DDRPHYC_ODTCR</name>
          <displayName>DDRPHYC_ODTCR</displayName>
          <description>DDRPHYC ODTC register</description>
          <addressOffset>0x50</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x84210000</resetValue>
          <fields>
            <field>
              <name>RDODT</name>
              <description>RDODT</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WRODT</name>
              <description>WRODT</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DDRPHYC_DTAR</name>
          <displayName>DDRPHYC_DTAR</displayName>
          <description>DDRPHYC DTA register</description>
          <addressOffset>0x54</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DTCOL</name>
              <description>DTCOL</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
            <field>
              <name>DTROW</name>
              <description>DTROW</description>
              <bitOffset>12</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
            <field>
              <name>DTBANK</name>
              <description>DTBANK</description>
              <bitOffset>28</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>DTMPR</name>
              <description>DTMPR</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DDRPHYC_DTDR0</name>
          <displayName>DDRPHYC_DTDR0</displayName>
          <description>DDRPHYC DTD register 0</description>
          <addressOffset>0x58</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0xDD22EE11</resetValue>
          <fields>
            <field>
              <name>DTBYTE0</name>
              <description>DTBYTE0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>DTBYTE1</name>
              <description>DTBYTE1</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>DTBYTE2</name>
              <description>DTBYTE2</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>DTBYTE3</name>
              <description>DTBYTE3</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
