henri-32/esp32-tiller-autopilot/.pio-core/platforms/ststm32/misc/svd/STM32MP153x.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="DLYBSD1">
      <name>DLYBSD2</name>
      <baseAddress>0x58008000</baseAddress>
    </peripheral>
	<peripheral derivedFrom="DLYBSD1">
      <name>DLYBSD3</name>
      <baseAddress>0x48005000</baseAddress>
    </peripheral>
    <peripheral>
      <name>DFSDM1</name>
      <description>DFSDM1</description>
      <groupName>DFSDM1</groupName>
      <baseAddress>0x4400D000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x800</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>DFSDM_CH0CFGR1</name>
          <displayName>DFSDM_CH0CFGR1</displayName>
          <description>This register specifies the parameters used by channel y.</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SITP</name>
              <description>SITP</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>SPICKSEL</name>
              <description>SPICKSEL</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>SCDEN</name>
              <description>SCDEN</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CKABEN</name>
              <description>CKABEN</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CHEN</name>
              <description>CHEN</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CHINSEL</name>
              <description>CHINSEL</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DATMPX</name>
              <description>DATMPX</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>DATPACK</name>
              <description>DATPACK</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CKOUTDIV</name>
              <description>CKOUTDIV</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>CKOUTSRC</name>
              <description>CKOUTSRC</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DFSDMEN</name>
              <description>DFSDMEN</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DFSDM_CH0CFGR2</name>
          <displayName>DFSDM_CH0CFGR2</displayName>
          <description>This register specifies the parameters used by channel y.</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DTRBS</name>
              <description>DTRBS</description>
              <bitOffset>3</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>OFFSET</name>
              <description>OFFSET</description>
              <bitOffset>8</bitOffset>
              <bitWidth>24</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DFSDM_CH0AWSCDR</name>
          <displayName>DFSDM_CH0AWSCDR</displayName>
          <description>Short-circuit detector and analog watchdog settings for channel y.</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SCDT</name>
              <description>SCDT</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>BKSCD</name>
              <description>BKSCD</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>AWFOSR</name>
              <description>AWFOSR</description>
              <bitOffset>16</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>AWFORD</name>
              <description>AWFORD</description>
              <bitOffset>22</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DFSDM_CH0WDATR</name>
          <displayName>DFSDM_CH0WDATR</displayName>
          <description>This register contains the data resulting from the analog watchdog filter associated to the input channel y.</description>
          <addressOffset>0xC</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>WDATA</name>
              <description>WDATA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DFSDM_CH0DATINR</name>
          <displayName>DFSDM_CH0DATINR</displayName>
          <description>This register contains 16-bit input data to be processed by DFSDM filter module.</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>INDAT0</name>
              <description>INDAT0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
            <field>
              <name>INDAT1</name>
              <description>INDAT1</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DFSDM_CH0DLYR</name>
          <displayName>DFSDM_CH0DLYR</displayName>
          <description>DFSDM channel 0 delay register</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PLSSKP</name>
              <description>PLSSKP</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DFSDM_CH1CFGR1</name>
          <displayName>DFSDM_CH1CFGR1</displayName>
          <description>This register specifies the parameters used by channel y.</description>
          <addressOffset>0x20</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SITP</name>
              <description>SITP</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>SPICKSEL</name>
              <description>SPICKSEL</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>SCDEN</name>
              <description>SCDEN</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CKABEN</name>
              <description>CKABEN</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CHEN</name>
              <description>CHEN</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CHINSEL</name>
              <description>CHINSEL</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DATMPX</name>
              <description>DATMPX</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>DATPACK</name>
              <description>DATPACK</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CKOUTDIV</name>
              <description>CKOUTDIV</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>CKOUTSRC</name>
              <description>CKOUTSRC</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DFSDMEN</name>
              <description>DFSDMEN</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DFSDM_CH1CFGR2</name>
          <displayName>DFSDM_CH1CFGR2</displayName>
          <description>This register specifies the parameters used by channel y.</description>
          <addressOffset>0x24</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DTRBS</name>
              <description>DTRBS</description>
              <bitOffset>3</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>OFFSET</name>
              <description>OFFSET</description>
              <bitOffset>8</bitOffset>
              <bitWidth>24</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DFSDM_CH1AWSCDR</name>
          <displayName>DFSDM_CH1AWSCDR</displayName>
          <description>Short-circuit detector and analog watchdog settings for channel y.</description>
          <addressOffset>0x28</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SCDT</name>
              <description>SCDT</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>BKSCD</name>
              <description>BKSCD</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>AWFOSR</name>
              <description>AWFOSR</description>
              <bitOffset>16</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>AWFORD</name>
              <description>AWFORD</description>
              <bitOffset>22</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DFSDM_CH1WDATR</name>
          <displayName>DFSDM_CH1WDATR</displayName>
          <description>This register contains the data resulting from the analog watchdog filter associated to the input channel y.</description>
          <addressOffset>0x2C</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>WDATA</name>
              <description>WDATA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DFSDM_CH1DATINR</name>
          <displayName>DFSDM_CH1DATINR</displayName>
          <description>This register contains 16-bit input data to be processed by DFSDM filter module.</description>
          <addressOffset>0x30</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>INDAT0</name>
              <description>INDAT0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
            <field>
              <name>INDAT1</name>
              <description>INDAT1</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DFSDM_CH1DLYR</name>
          <displayName>DFSDM_CH1DLYR</displayName>
          <description>DFSDM channel 1 delay register</description>
          <addressOffset>0x34</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PLSSKP</name>
              <description>PLSSKP</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DFSDM_CH2CFGR1</name>
          <displayName>DFSDM_CH2CFGR1</displayName>
          <description>This register specifies the parameters used by channel y.</description>
          <addressOffset>0x40</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SITP</name>
              <description>SITP</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>SPICKSEL</name>
              <description>SPICKSEL</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>SCDEN</name>
              <description>SCDEN</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CKABEN</name>
              <description>CKABEN</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CHEN</name>
              <description>CHEN</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CHINSEL</name>
              <description>CHINSEL</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DATMPX</name>
              <description>DATMPX</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>DATPACK</name>
              <description>DATPACK</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CKOUTDIV</name>
              <description>CKOUTDIV</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>CKOUTSRC</name>
              <description>CKOUTSRC</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DFSDMEN</name>
              <description>DFSDMEN</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DFSDM_CH2CFGR2</name>
          <displayName>DFSDM_CH2CFGR2</displayName>
          <description>This register specifies the parameters used by channel y.</description>
          <addressOffset>0x44</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DTRBS</name>
              <description>DTRBS</description>
              <bitOffset>3</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>OFFSET</name>
              <description>OFFSET</description>
              <bitOffset>8</bitOffset>
              <bitWidth>24</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DFSDM_CH2AWSCDR</name>
          <displayName>DFSDM_CH2AWSCDR</displayName>
          <description>Short-circuit detector and analog watchdog settings for channel y.</description>
          <addressOffset>0x48</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SCDT</name>
              <description>SCDT</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>BKSCD</name>
              <description>BKSCD</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>AWFOSR</name>
              <description>AWFOSR</description>
              <bitOffset>16</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>AWFORD</name>
              <description>AWFORD</description>
              <bitOffset>22</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DFSDM_CH2WDATR</name>
          <displayName>DFSDM_CH2WDATR</displayName>
          <description>This register contains the data resulting from the analog watchdog filter associated to the input channel y.</description>
          <addressOffset>0x4C</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>WDATA</name>
              <description>WDATA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DFSDM_CH2DATINR</name>
          <displayName>DFSDM_CH2DATINR</displayName>
          <description>This register contains 16-bit input data to be processed by DFSDM filter module.</description>
          <addressOffset>0x50</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>INDAT0</name>
              <description>INDAT0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
            <field>
              <name>INDAT1</name>
              <description>INDAT1</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DFSDM_CH2DLYR</name>
          <displayName>DFSDM_CH2DLYR</displayName>
          <description>DFSDM channel 2 delay register</description>
          <addressOffset>0x54</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PLSSKP</name>
              <description>PLSSKP</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DFSDM_CH3CFGR1</name>
          <displayName>DFSDM_CH3CFGR1</displayName>
          <description>This register specifies the parameters used by channel y.</description>
          <addressOffset>0x60</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SITP</name>
              <description>SITP</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>SPICKSEL</name>
              <description>SPICKSEL</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>SCDEN</name>
              <description>SCDEN</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CKABEN</name>
              <description>CKABEN</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CHEN</name>
              <description>CHEN</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CHINSEL</name>
              <description>CHINSEL</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DATMPX</name>
              <description>DATMPX</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>DATPACK</name>
              <description>DATPACK</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CKOUTDIV</name>
              <description>CKOUTDIV</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>CKOUTSRC</name>
              <description>CKOUTSRC</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DFSDMEN</name>
              <description>DFSDMEN</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
