henri-32/esp32-tiller-autopilot/.pio-core/platforms/ststm32/misc/svd/STM32MP153x.svd
        <register>
          <name>ETH_MTLRxQ1MPOCR</name>
          <displayName>ETH_MTLRxQ1MPOCR</displayName>
          <description>Rx queue 1 missed packet and overflow
          counter register</description>
          <addressOffset>0x0174</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>OVFPKTCNT</name>
              <description>OVFPKTCNT</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OVFCNTOVF</name>
              <description>OVFCNTOVF</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MISPKTCNT</name>
              <description>MISPKTCNT</description>
              <bitOffset>16</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MISCNTOVF</name>
              <description>MISCNTOVF</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ETH_MTLRxQ0DR</name>
          <displayName>ETH_MTLRxQ0DR</displayName>
          <description>Rx queue i debug register</description>
          <addressOffset>0x0138</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RWCSTS</name>
              <description>RWCSTS</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RRCSTS</name>
              <description>RRCSTS</description>
              <bitOffset>1</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RXQSTS</name>
              <description>RXQSTS</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PRXQ</name>
              <description>PRXQ</description>
              <bitOffset>16</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ETH_MTLRxQ1DR</name>
          <displayName>ETH_MTLRxQ1DR</displayName>
          <description>Rx queue i debug register</description>
          <addressOffset>0x0178</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RWCSTS</name>
              <description>RWCSTS</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RRCSTS</name>
              <description>RRCSTS</description>
              <bitOffset>1</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RXQSTS</name>
              <description>RXQSTS</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PRXQ</name>
              <description>PRXQ</description>
              <bitOffset>16</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ETH_MTLRxQ0CR</name>
          <displayName>ETH_MTLRxQ0CR</displayName>
          <description>Rx queue 0 control register</description>
          <addressOffset>0x013C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RXQ_WEGT</name>
              <description>RXQ_WEGT</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RXQ_FRM_ARBIT</name>
              <description>RXQ_FRM_ARBIT</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ETH_MTLRxQ1CR</name>
          <displayName>ETH_MTLRxQ1CR</displayName>
          <description>Rx queue 1 control register</description>
          <addressOffset>0x017C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RXQ_WEGT</name>
              <description>RXQ_WEGT</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RXQ_FRM_ARBIT</name>
              <description>RXQ_FRM_ARBIT</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ETH_MTLTxQ1ECR</name>
          <displayName>ETH_MTLTxQ1ECR</displayName>
          <description>The Queue ETS Control register controls the
          enhanced transmission selection operation.</description>
          <addressOffset>0x150</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>AVALG</name>
              <description>AVALG</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CC</name>
              <description>CC</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SLC</name>
              <description>SLC</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ETH_MTLTxQ1QWR</name>
          <displayName>ETH_MTLTxQ1QWR</displayName>
          <description>This register provides the average traffic
          transmitted on queue 1.</description>
          <addressOffset>0x158</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ISCQW</name>
              <description>ISCQW</description>
              <bitOffset>0</bitOffset>
              <bitWidth>21</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ETH_MTLTxQ1SSCR</name>
          <displayName>ETH_MTLTxQ1SSCR</displayName>
          <description>The sendSlopeCredit register contains the
          sendSlope credit value required for the credit-based
          shaper algorithm for the Queue.</description>
          <addressOffset>0x15C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SSC</name>
              <description>SSC</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ETH_MTLTxQ1HCR</name>
          <displayName>ETH_MTLTxQ1HCR</displayName>
          <description>The hiCredit register contains the hiCredit
          value required for the credit-based shaper algorithm for
          the Queue.</description>
          <addressOffset>0x160</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>HC</name>
              <description>HC</description>
              <bitOffset>0</bitOffset>
              <bitWidth>29</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ETH_MTLTxQ1LCR</name>
          <displayName>ETH_MTLTxQ1LCR</displayName>
          <description>The loCredit register contains the loCredit
          value required for the credit-based shaper algorithm for
          the Queue.</description>
          <addressOffset>0x164</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LC</name>
              <description>LC</description>
              <bitOffset>0</bitOffset>
              <bitWidth>29</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
