henri-32/esp32-tiller-autopilot/.pio-core/platforms/ststm32/misc/svd/STM32MP153x.svd
        <register>
          <name>FMC_HWCFGR2</name>
          <displayName>FMC_HWCFGR2</displayName>
          <description>FMC Hardware configuration register 2</description>
          <addressOffset>0x3EC</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00DC8762</resetValue>
          <fields>
            <field>
              <name>RD_LN2DPTH</name>
              <description>RD_LN2DPTH</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>NOR_BASE</name>
              <description>NOR_BASE</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>SDRAM_RBASE</name>
              <description>SDRAM_RBASE</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>NAND_BASE</name>
              <description>NAND_BASE</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>SDRAM1_BASE</name>
              <description>SDRAM1_BASE</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>SDRAM2_BASE</name>
              <description>SDRAM2_BASE</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FMC_HWCFGR1</name>
          <displayName>FMC_HWCFGR1</displayName>
          <description>FMC Hardware configuration register 1</description>
          <addressOffset>0x3F0</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x2232B011</resetValue>
          <fields>
            <field>
              <name>NAND_SEL</name>
              <description>NAND_SEL</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>NAND_ECC</name>
              <description>NAND_ECC</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SDRAM_SEL</name>
              <description>SDRAM_SEL</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ID_SIZE</name>
              <description>ID_SIZE</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>WA_LN2DPTH</name>
              <description>WA_LN2DPTH</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>WD_LN2DPTH</name>
              <description>WD_LN2DPTH</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>WR_LN2DPTH</name>
              <description>WR_LN2DPTH</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>RA_LN2DPTH</name>
              <description>RA_LN2DPTH</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FMC_VERR</name>
          <displayName>FMC_VERR</displayName>
          <description>FMC Version register</description>
          <addressOffset>0x3F4</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000011</resetValue>
          <fields>
            <field>
              <name>MINREV</name>
              <description>MINREV</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>MAJREV</name>
              <description>MAJREV</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FMC_IPIDR</name>
          <displayName>FMC_IPIDR</displayName>
          <description>FMC Identification register</description>
          <addressOffset>0x3F8</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00140001</resetValue>
          <fields>
            <field>
              <name>ID</name>
              <description>ID</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FMC_SIDR</name>
          <displayName>FMC_SIDR</displayName>
          <description>FMC Size Identification register</description>
          <addressOffset>0x3FC</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0xA3C5DD01</resetValue>
          <fields>
            <field>
              <name>SID</name>
              <description>SID</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>GICD</name>
      <description>GICD</description>
      <groupName>GICD</groupName>
      <baseAddress>0xA0021000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>GICD_CTLR</name>
          <displayName>GICD_CTLR</displayName>
          <description>GICD control register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ENABLEGRP0</name>
              <description>ENABLEGRP0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ENABLEGRP1</name>
              <description>ENABLEGRP1</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GICD_TYPER</name>
          <displayName>GICD_TYPER</displayName>
          <description>GICD interrupt controller type register</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x0000FC28</resetValue>
          <fields>
            <field>
              <name>ITLINESNUMBER</name>
              <description>ITLINESNUMBER</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>CPUNUMBER</name>
              <description>CPUNUMBER</description>
              <bitOffset>5</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>SECURITYEXTN</name>
              <description>SECURITYEXTN</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LSPI</name>
              <description>LSPI</description>
              <bitOffset>11</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GICD_IIDR</name>
          <displayName>GICD_IIDR</displayName>
          <description>GICD implementer identification register</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x0100143B</resetValue>
          <fields>
            <field>
              <name>IMPLEMENTER</name>
              <description>IMPLEMENTER</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
            <field>
              <name>VARIANT</name>
              <description>VARIANT</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>REVISION</name>
              <description>REVISION</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>PRODUCTID</name>
              <description>PRODUCTID</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GICD_IGROUPR0</name>
          <displayName>GICD_IGROUPR0</displayName>
          <description>For interrupts ID</description>
          <addressOffset>0x80</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>IGROUPR0</name>
              <description>IGROUPR0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GICD_IGROUPR1</name>
          <displayName>GICD_IGROUPR1</displayName>
          <description>For interrupts ID </description>
          <addressOffset>0x84</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>IGROUPR1</name>
              <description>IGROUPR1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GICD_IGROUPR2</name>
          <displayName>GICD_IGROUPR2</displayName>
          <description>For interrupts ID </description>
          <addressOffset>0x88</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>IGROUPR2</name>
              <description>IGROUPR2</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GICD_IGROUPR3</name>
          <displayName>GICD_IGROUPR3</displayName>
          <description>For interrupts ID = x*32 to ID = x*32+31</description>
          <addressOffset>0x8C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>IGROUPR3</name>
              <description>IGROUPR3</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GICD_IGROUPR4</name>
          <displayName>GICD_IGROUPR4</displayName>
          <description>For interrupts ID = x*32 to ID = x*32+31</description>
          <addressOffset>0x90</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>IGROUPR4</name>
              <description>IGROUPR4</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GICD_IGROUPR5</name>
          <displayName>GICD_IGROUPR5</displayName>
          <description>For interrupts ID </description>
          <addressOffset>0x94</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>IGROUPR5</name>
              <description>IGROUPR5</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GICD_IGROUPR6</name>
          <displayName>GICD_IGROUPR6</displayName>
          <description>For interrupts ID </description>
          <addressOffset>0x98</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>IGROUPR6</name>
              <description>IGROUPR6</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GICD_IGROUPR7</name>
          <displayName>GICD_IGROUPR7</displayName>
          <description>For interrupts ID </description>
          <addressOffset>0x9C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>IGROUPR7</name>
              <description>IGROUPR7</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GICD_IGROUPR8</name>
          <displayName>GICD_IGROUPR8</displayName>
          <description>For interrupts ID </description>
          <addressOffset>0xA0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>IGROUPR8</name>
              <description>IGROUPR8</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GICD_ISENABLER0</name>
          <displayName>GICD_ISENABLER0</displayName>
          <description>For interrupts ID = 0 to ID = 31</description>
          <addressOffset>0x100</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000FFFF</resetValue>
          <fields>
            <field>
              <name>ISENABLER0</name>
              <description>ISENABLER0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GICD_ISENABLER1</name>
          <displayName>GICD_ISENABLER1</displayName>
          <description>For interrupts ID </description>
          <addressOffset>0x104</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ISENABLER1</name>
              <description>ISENABLER1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GICD_ISENABLER2</name>
          <displayName>GICD_ISENABLER2</displayName>
          <description>For interrupts ID </description>
          <addressOffset>0x108</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ISENABLER2</name>
              <description>ISENABLER2</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GICD_ISENABLER3</name>
          <displayName>GICD_ISENABLER3</displayName>
          <description>For interrupts ID </description>
          <addressOffset>0x10C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ISENABLER3</name>
              <description>ISENABLER3</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GICD_ISENABLER4</name>
          <displayName>GICD_ISENABLER4</displayName>
          <description>For interrupts ID </description>
          <addressOffset>0x110</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ISENABLER4</name>
              <description>ISENABLER4</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GICD_ISENABLER5</name>
          <displayName>GICD_ISENABLER5</displayName>
          <description>For interrupts ID </description>
          <addressOffset>0x114</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ISENABLER5</name>
              <description>ISENABLER5</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GICD_ISENABLER6</name>
          <displayName>GICD_ISENABLER6</displayName>
          <description>For interrupts ID </description>
          <addressOffset>0x118</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ISENABLER6</name>
              <description>ISENABLER6</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GICD_ISENABLER7</name>
          <displayName>GICD_ISENABLER7</displayName>
          <description>For interrupts ID </description>
          <addressOffset>0x11C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ISENABLER7</name>
              <description>ISENABLER7</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GICD_ISENABLER8</name>
          <displayName>GICD_ISENABLER8</displayName>
          <description>For interrupts ID </description>
          <addressOffset>0x120</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ISENABLER8</name>
              <description>ISENABLER8</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GICD_ICENABLER0</name>
          <displayName>GICD_ICENABLER0</displayName>
          <description>For interrupts ID = 0 to ID = 31</description>
          <addressOffset>0x180</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000FFFF</resetValue>
          <fields>
            <field>
              <name>ICENABLER0</name>
              <description>ICENABLER0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GICD_ICENABLER1</name>
          <displayName>GICD_ICENABLER1</displayName>
          <description>For interrupts ID </description>
          <addressOffset>0x184</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ICENABLER1</name>
              <description>ICENABLER1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GICD_ICENABLER2</name>
          <displayName>GICD_ICENABLER2</displayName>
          <description>For interrupts ID </description>
          <addressOffset>0x188</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ICENABLER2</name>
              <description>ICENABLER2</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GICD_ICENABLER3</name>
          <displayName>GICD_ICENABLER3</displayName>
          <description>For interrupts ID </description>
          <addressOffset>0x18C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ICENABLER3</name>
              <description>ICENABLER3</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GICD_ICENABLER4</name>
          <displayName>GICD_ICENABLER4</displayName>
          <description>For interrupts ID </description>
          <addressOffset>0x190</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ICENABLER4</name>
              <description>ICENABLER4</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GICD_ICENABLER5</name>
          <displayName>GICD_ICENABLER5</displayName>
          <description>For interrupts ID </description>
          <addressOffset>0x194</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ICENABLER5</name>
              <description>ICENABLER5</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GICD_ICENABLER6</name>
          <displayName>GICD_ICENABLER6</displayName>
          <description>For interrupts ID </description>
          <addressOffset>0x198</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ICENABLER6</name>
              <description>ICENABLER6</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
