henri-32/esp32-tiller-autopilot/.pio-core/platforms/ststm32/misc/svd/STM32MP153x.svd
        <register>
          <name>GICD_ICENABLER7</name>
          <displayName>GICD_ICENABLER7</displayName>
          <description>For interrupts ID </description>
          <addressOffset>0x19C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ICENABLER7</name>
              <description>ICENABLER7</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GICD_ICENABLER8</name>
          <displayName>GICD_ICENABLER8</displayName>
          <description>For interrupts ID </description>
          <addressOffset>0x1A0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ICENABLER8</name>
              <description>ICENABLER8</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GICD_ISPENDR0</name>
          <displayName>GICD_ISPENDR0</displayName>
          <description>For interrupts ID </description>
          <addressOffset>0x200</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ISPENDR0</name>
              <description>ISPENDR0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GICD_ISPENDR1</name>
          <displayName>GICD_ISPENDR1</displayName>
          <description>For interrupts ID </description>
          <addressOffset>0x204</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ISPENDR1</name>
              <description>ISPENDR1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GICD_ISPENDR2</name>
          <displayName>GICD_ISPENDR2</displayName>
          <description>For interrupts ID </description>
          <addressOffset>0x208</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ISPENDR2</name>
              <description>ISPENDR2</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GICD_ISPENDR3</name>
          <displayName>GICD_ISPENDR3</displayName>
          <description>For interrupts ID </description>
          <addressOffset>0x20C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ISPENDR3</name>
              <description>ISPENDR3</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GICD_ISPENDR4</name>
          <displayName>GICD_ISPENDR4</displayName>
          <description>For interrupts ID </description>
          <addressOffset>0x210</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ISPENDR4</name>
              <description>ISPENDR4</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GICD_ISPENDR5</name>
          <displayName>GICD_ISPENDR5</displayName>
          <description>For interrupts ID </description>
          <addressOffset>0x214</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ISPENDR5</name>
              <description>ISPENDR5</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GICD_ISPENDR6</name>
          <displayName>GICD_ISPENDR6</displayName>
          <description>For interrupts ID </description>
          <addressOffset>0x218</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ISPENDR6</name>
              <description>ISPENDR6</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GICD_ISPENDR7</name>
          <displayName>GICD_ISPENDR7</displayName>
          <description>For interrupts ID </description>
          <addressOffset>0x21C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ISPENDR7</name>
              <description>ISPENDR7</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GICD_ISPENDR8</name>
          <displayName>GICD_ISPENDR8</displayName>
          <description>For interrupts ID </description>
          <addressOffset>0x220</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ISPENDR8</name>
              <description>ISPENDR8</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GICD_ICPENDR0</name>
          <displayName>GICD_ICPENDR0</displayName>
          <description>For interrupts ID </description>
          <addressOffset>0x280</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ICPENDR0</name>
              <description>ICPENDR0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GICD_ICPENDR1</name>
          <displayName>GICD_ICPENDR1</displayName>
          <description>For interrupts ID </description>
          <addressOffset>0x284</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ICPENDR1</name>
              <description>ICPENDR1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GICD_ICPENDR2</name>
          <displayName>GICD_ICPENDR2</displayName>
          <description>For interrupts ID </description>
          <addressOffset>0x288</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ICPENDR2</name>
              <description>ICPENDR2</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GICD_ICPENDR3</name>
          <displayName>GICD_ICPENDR3</displayName>
          <description>For interrupts ID </description>
          <addressOffset>0x28C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ICPENDR3</name>
              <description>ICPENDR3</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GICD_ICPENDR4</name>
          <displayName>GICD_ICPENDR4</displayName>
          <description>For interrupts ID </description>
          <addressOffset>0x290</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ICPENDR4</name>
              <description>ICPENDR4</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GICD_ICPENDR5</name>
          <displayName>GICD_ICPENDR5</displayName>
          <description>For interrupts ID </description>
          <addressOffset>0x294</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ICPENDR5</name>
              <description>ICPENDR5</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GICD_ICPENDR6</name>
          <displayName>GICD_ICPENDR6</displayName>
          <description>For interrupts ID </description>
          <addressOffset>0x298</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ICPENDR6</name>
              <description>ICPENDR6</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GICD_ICPENDR7</name>
          <displayName>GICD_ICPENDR7</displayName>
          <description>For interrupts ID </description>
          <addressOffset>0x29C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ICPENDR7</name>
              <description>ICPENDR7</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GICD_ICPENDR8</name>
          <displayName>GICD_ICPENDR8</displayName>
          <description>For interrupts ID </description>
          <addressOffset>0x2A0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ICPENDR8</name>
              <description>ICPENDR8</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GICD_ISACTIVER0</name>
          <displayName>GICD_ISACTIVER0</displayName>
          <description>For interrupts ID </description>
          <addressOffset>0x300</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ISACTIVER0</name>
              <description>ISACTIVER0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GICD_ISACTIVER1</name>
          <displayName>GICD_ISACTIVER1</displayName>
          <description>For interrupts ID </description>
          <addressOffset>0x304</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ISACTIVER1</name>
              <description>ISACTIVER1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GICD_ISACTIVER2</name>
          <displayName>GICD_ISACTIVER2</displayName>
          <description>For interrupts ID </description>
          <addressOffset>0x308</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ISACTIVER2</name>
              <description>ISACTIVER2</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GICD_ISACTIVER3</name>
          <displayName>GICD_ISACTIVER3</displayName>
          <description>For interrupts ID </description>
          <addressOffset>0x30C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ISACTIVER3</name>
              <description>ISACTIVER3</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GICD_ISACTIVER4</name>
          <displayName>GICD_ISACTIVER4</displayName>
          <description>For interrupts ID </description>
          <addressOffset>0x310</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ISACTIVER4</name>
              <description>ISACTIVER4</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GICD_ISACTIVER5</name>
          <displayName>GICD_ISACTIVER5</displayName>
          <description>For interrupts ID </description>
          <addressOffset>0x314</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ISACTIVER5</name>
              <description>ISACTIVER5</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GICD_ISACTIVER6</name>
          <displayName>GICD_ISACTIVER6</displayName>
          <description>For interrupts ID </description>
          <addressOffset>0x318</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ISACTIVER6</name>
              <description>ISACTIVER6</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GICD_ISACTIVER7</name>
          <displayName>GICD_ISACTIVER7</displayName>
          <description>For interrupts ID </description>
          <addressOffset>0x31C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ISACTIVER7</name>
              <description>ISACTIVER7</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GICD_ISACTIVER8</name>
          <displayName>GICD_ISACTIVER8</displayName>
          <description>For interrupts ID </description>
          <addressOffset>0x320</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ISACTIVER8</name>
              <description>ISACTIVER8</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GICD_ICACTIVER0</name>
          <displayName>GICD_ICACTIVER0</displayName>
          <description>For interrupts ID </description>
          <addressOffset>0x380</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ICACTIVER0</name>
              <description>ICACTIVER0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GICD_ICACTIVER1</name>
          <displayName>GICD_ICACTIVER1</displayName>
          <description>For interrupts ID </description>
          <addressOffset>0x384</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ICACTIVER1</name>
              <description>ICACTIVER1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GICD_ICACTIVER2</name>
          <displayName>GICD_ICACTIVER2</displayName>
          <description>For interrupts ID </description>
          <addressOffset>0x388</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ICACTIVER2</name>
              <description>ICACTIVER2</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GICD_ICACTIVER3</name>
          <displayName>GICD_ICACTIVER3</displayName>
          <description>For interrupts ID </description>
          <addressOffset>0x38C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ICACTIVER3</name>
              <description>ICACTIVER3</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GICD_ICACTIVER4</name>
          <displayName>GICD_ICACTIVER4</displayName>
          <description>For interrupts ID </description>
          <addressOffset>0x390</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ICACTIVER4</name>
              <description>ICACTIVER4</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GICD_ICACTIVER5</name>
          <displayName>GICD_ICACTIVER5</displayName>
          <description>For interrupts ID </description>
          <addressOffset>0x394</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ICACTIVER5</name>
              <description>ICACTIVER5</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GICD_ICACTIVER6</name>
          <displayName>GICD_ICACTIVER6</displayName>
          <description>For interrupts ID </description>
          <addressOffset>0x398</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ICACTIVER6</name>
              <description>ICACTIVER6</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GICD_ICACTIVER7</name>
          <displayName>GICD_ICACTIVER7</displayName>
          <description>For interrupts ID </description>
          <addressOffset>0x39C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ICACTIVER7</name>
              <description>ICACTIVER7</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GICD_ICACTIVER8</name>
          <displayName>GICD_ICACTIVER8</displayName>
          <description>For interrupts ID </description>
          <addressOffset>0x3A0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ICACTIVER8</name>
              <description>ICACTIVER8</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GICD_IPRIORITYR0</name>
          <displayName>GICD_IPRIORITYR0</displayName>
          <description>GICD interrupt priority register 0</description>
          <addressOffset>0x400</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PRIORITY0</name>
              <description>PRIORITY0</description>
              <bitOffset>3</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>PRIORITY1</name>
              <description>PRIORITY1</description>
              <bitOffset>11</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>PRIORITY2</name>
              <description>PRIORITY2</description>
              <bitOffset>19</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>PRIORITY3</name>
              <description>PRIORITY3</description>
              <bitOffset>27</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
