henri-32/esp32-tiller-autopilot/.pio-core/platforms/ststm32/misc/svd/STM32MP153x.svd
        <register>
          <name>GICD_IPRIORITYR1</name>
          <displayName>GICD_IPRIORITYR1</displayName>
          <description>GICD interrupt priority register 1</description>
          <addressOffset>0x404</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PRIORITY0</name>
              <description>PRIORITY0</description>
              <bitOffset>3</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>PRIORITY1</name>
              <description>PRIORITY1</description>
              <bitOffset>11</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>PRIORITY2</name>
              <description>PRIORITY2</description>
              <bitOffset>19</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>PRIORITY3</name>
              <description>PRIORITY3</description>
              <bitOffset>27</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GICD_IPRIORITYR2</name>
          <displayName>GICD_IPRIORITYR2</displayName>
          <description>GICD interrupt priority register 2</description>
          <addressOffset>0x408</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PRIORITY0</name>
              <description>PRIORITY0</description>
              <bitOffset>3</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>PRIORITY1</name>
              <description>PRIORITY1</description>
              <bitOffset>11</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>PRIORITY2</name>
              <description>PRIORITY2</description>
              <bitOffset>19</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>PRIORITY3</name>
              <description>PRIORITY3</description>
              <bitOffset>27</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GICD_IPRIORITYR3</name>
          <displayName>GICD_IPRIORITYR3</displayName>
          <description>GICD interrupt priority register 3</description>
          <addressOffset>0x40C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PRIORITY0</name>
              <description>PRIORITY0</description>
              <bitOffset>3</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>PRIORITY1</name>
              <description>PRIORITY1</description>
              <bitOffset>11</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>PRIORITY2</name>
              <description>PRIORITY2</description>
              <bitOffset>19</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>PRIORITY3</name>
              <description>PRIORITY3</description>
              <bitOffset>27</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GICD_IPRIORITYR4</name>
          <displayName>GICD_IPRIORITYR4</displayName>
          <description>GICD interrupt priority register 4</description>
          <addressOffset>0x410</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PRIORITY0</name>
              <description>PRIORITY0</description>
              <bitOffset>3</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>PRIORITY1</name>
              <description>PRIORITY1</description>
              <bitOffset>11</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>PRIORITY2</name>
              <description>PRIORITY2</description>
              <bitOffset>19</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>PRIORITY3</name>
              <description>PRIORITY3</description>
              <bitOffset>27</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GICD_IPRIORITYR5</name>
          <displayName>GICD_IPRIORITYR5</displayName>
          <description>GICD interrupt priority register 5</description>
          <addressOffset>0x414</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PRIORITY0</name>
              <description>PRIORITY0</description>
              <bitOffset>3</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>PRIORITY1</name>
              <description>PRIORITY1</description>
              <bitOffset>11</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>PRIORITY2</name>
              <description>PRIORITY2</description>
              <bitOffset>19</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>PRIORITY3</name>
              <description>PRIORITY3</description>
              <bitOffset>27</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GICD_IPRIORITYR6</name>
          <displayName>GICD_IPRIORITYR6</displayName>
          <description>GICD interrupt priority register 6</description>
          <addressOffset>0x418</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PRIORITY0</name>
              <description>PRIORITY0</description>
              <bitOffset>3</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>PRIORITY1</name>
              <description>PRIORITY1</description>
              <bitOffset>11</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>PRIORITY2</name>
              <description>PRIORITY2</description>
              <bitOffset>19</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>PRIORITY3</name>
              <description>PRIORITY3</description>
              <bitOffset>27</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GICD_IPRIORITYR7</name>
          <displayName>GICD_IPRIORITYR7</displayName>
          <description>GICD interrupt priority register 7</description>
          <addressOffset>0x41C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PRIORITY0</name>
              <description>PRIORITY0</description>
              <bitOffset>3</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>PRIORITY1</name>
              <description>PRIORITY1</description>
              <bitOffset>11</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>PRIORITY2</name>
              <description>PRIORITY2</description>
              <bitOffset>19</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>PRIORITY3</name>
              <description>PRIORITY3</description>
              <bitOffset>27</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GICD_IPRIORITYR8</name>
          <displayName>GICD_IPRIORITYR8</displayName>
          <description>GICD interrupt priority register 8</description>
          <addressOffset>0x420</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PRIORITY0</name>
              <description>PRIORITY0</description>
              <bitOffset>3</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>PRIORITY1</name>
              <description>PRIORITY1</description>
              <bitOffset>11</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>PRIORITY2</name>
              <description>PRIORITY2</description>
              <bitOffset>19</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>PRIORITY3</name>
              <description>PRIORITY3</description>
              <bitOffset>27</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GICD_IPRIORITYR9</name>
          <displayName>GICD_IPRIORITYR9</displayName>
          <description>GICD interrupt priority register 9</description>
          <addressOffset>0x424</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PRIORITY0</name>
              <description>PRIORITY0</description>
              <bitOffset>3</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>PRIORITY1</name>
              <description>PRIORITY1</description>
              <bitOffset>11</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>PRIORITY2</name>
              <description>PRIORITY2</description>
              <bitOffset>19</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>PRIORITY3</name>
              <description>PRIORITY3</description>
              <bitOffset>27</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GICD_IPRIORITYR10</name>
          <displayName>GICD_IPRIORITYR10</displayName>
          <description>GICD interrupt priority register 10</description>
          <addressOffset>0x428</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PRIORITY0</name>
              <description>PRIORITY0</description>
              <bitOffset>3</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>PRIORITY1</name>
              <description>PRIORITY1</description>
              <bitOffset>11</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>PRIORITY2</name>
              <description>PRIORITY2</description>
              <bitOffset>19</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>PRIORITY3</name>
              <description>PRIORITY3</description>
              <bitOffset>27</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GICD_IPRIORITYR11</name>
          <displayName>GICD_IPRIORITYR11</displayName>
          <description>GICD interrupt priority register 11</description>
          <addressOffset>0x42C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PRIORITY0</name>
              <description>PRIORITY0</description>
              <bitOffset>3</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>PRIORITY1</name>
              <description>PRIORITY1</description>
              <bitOffset>11</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>PRIORITY2</name>
              <description>PRIORITY2</description>
              <bitOffset>19</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>PRIORITY3</name>
              <description>PRIORITY3</description>
              <bitOffset>27</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GICD_IPRIORITYR12</name>
          <displayName>GICD_IPRIORITYR12</displayName>
          <description>GICD interrupt priority register 12</description>
          <addressOffset>0x430</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PRIORITY0</name>
              <description>PRIORITY0</description>
              <bitOffset>3</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>PRIORITY1</name>
              <description>PRIORITY1</description>
              <bitOffset>11</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>PRIORITY2</name>
              <description>PRIORITY2</description>
              <bitOffset>19</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>PRIORITY3</name>
              <description>PRIORITY3</description>
              <bitOffset>27</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GICD_IPRIORITYR13</name>
          <displayName>GICD_IPRIORITYR13</displayName>
          <description>GICD interrupt priority register 13</description>
          <addressOffset>0x434</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PRIORITY0</name>
              <description>PRIORITY0</description>
              <bitOffset>3</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>PRIORITY1</name>
              <description>PRIORITY1</description>
              <bitOffset>11</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>PRIORITY2</name>
              <description>PRIORITY2</description>
              <bitOffset>19</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>PRIORITY3</name>
              <description>PRIORITY3</description>
              <bitOffset>27</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GICD_IPRIORITYR14</name>
          <displayName>GICD_IPRIORITYR14</displayName>
          <description>GICD interrupt priority register 14</description>
          <addressOffset>0x438</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PRIORITY0</name>
              <description>PRIORITY0</description>
              <bitOffset>3</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>PRIORITY1</name>
              <description>PRIORITY1</description>
              <bitOffset>11</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>PRIORITY2</name>
              <description>PRIORITY2</description>
              <bitOffset>19</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>PRIORITY3</name>
              <description>PRIORITY3</description>
              <bitOffset>27</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GICD_IPRIORITYR15</name>
          <displayName>GICD_IPRIORITYR15</displayName>
          <description>GICD interrupt priority register 15</description>
          <addressOffset>0x43C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PRIORITY0</name>
              <description>PRIORITY0</description>
              <bitOffset>3</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>PRIORITY1</name>
              <description>PRIORITY1</description>
              <bitOffset>11</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>PRIORITY2</name>
              <description>PRIORITY2</description>
              <bitOffset>19</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>PRIORITY3</name>
              <description>PRIORITY3</description>
              <bitOffset>27</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GICD_IPRIORITYR16</name>
          <displayName>GICD_IPRIORITYR16</displayName>
          <description>GICD interrupt priority register 16</description>
          <addressOffset>0x440</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PRIORITY0</name>
              <description>PRIORITY0</description>
              <bitOffset>3</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>PRIORITY1</name>
              <description>PRIORITY1</description>
              <bitOffset>11</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>PRIORITY2</name>
              <description>PRIORITY2</description>
              <bitOffset>19</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>PRIORITY3</name>
              <description>PRIORITY3</description>
              <bitOffset>27</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GICD_IPRIORITYR17</name>
          <displayName>GICD_IPRIORITYR17</displayName>
          <description>GICD interrupt priority register 17</description>
          <addressOffset>0x444</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PRIORITY0</name>
              <description>PRIORITY0</description>
              <bitOffset>3</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>PRIORITY1</name>
              <description>PRIORITY1</description>
              <bitOffset>11</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>PRIORITY2</name>
              <description>PRIORITY2</description>
              <bitOffset>19</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>PRIORITY3</name>
              <description>PRIORITY3</description>
              <bitOffset>27</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GICD_IPRIORITYR18</name>
          <displayName>GICD_IPRIORITYR18</displayName>
          <description>GICD interrupt priority register 18</description>
          <addressOffset>0x448</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PRIORITY0</name>
              <description>PRIORITY0</description>
              <bitOffset>3</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>PRIORITY1</name>
              <description>PRIORITY1</description>
              <bitOffset>11</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>PRIORITY2</name>
              <description>PRIORITY2</description>
              <bitOffset>19</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>PRIORITY3</name>
              <description>PRIORITY3</description>
              <bitOffset>27</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GICD_IPRIORITYR19</name>
          <displayName>GICD_IPRIORITYR19</displayName>
          <description>GICD interrupt priority register 19</description>
          <addressOffset>0x44C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PRIORITY0</name>
              <description>PRIORITY0</description>
              <bitOffset>3</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>PRIORITY1</name>
              <description>PRIORITY1</description>
              <bitOffset>11</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>PRIORITY2</name>
              <description>PRIORITY2</description>
              <bitOffset>19</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>PRIORITY3</name>
              <description>PRIORITY3</description>
              <bitOffset>27</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
