henri-32/esp32-tiller-autopilot/.pio-core/platforms/ststm32/misc/svd/STM32MP153x.svd
        <register>
          <name>GICD_IPRIORITYR58</name>
          <displayName>GICD_IPRIORITYR58</displayName>
          <description>GICD interrupt priority register 58</description>
          <addressOffset>0x4E8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PRIORITY0</name>
              <description>PRIORITY0</description>
              <bitOffset>3</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>PRIORITY1</name>
              <description>PRIORITY1</description>
              <bitOffset>11</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>PRIORITY2</name>
              <description>PRIORITY2</description>
              <bitOffset>19</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>PRIORITY3</name>
              <description>PRIORITY3</description>
              <bitOffset>27</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GICD_IPRIORITYR59</name>
          <displayName>GICD_IPRIORITYR59</displayName>
          <description>GICD interrupt priority register 59</description>
          <addressOffset>0x4EC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PRIORITY0</name>
              <description>PRIORITY0</description>
              <bitOffset>3</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>PRIORITY1</name>
              <description>PRIORITY1</description>
              <bitOffset>11</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>PRIORITY2</name>
              <description>PRIORITY2</description>
              <bitOffset>19</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>PRIORITY3</name>
              <description>PRIORITY3</description>
              <bitOffset>27</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GICD_IPRIORITYR60</name>
          <displayName>GICD_IPRIORITYR60</displayName>
          <description>GICD interrupt priority register 60</description>
          <addressOffset>0x4F0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PRIORITY0</name>
              <description>PRIORITY0</description>
              <bitOffset>3</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>PRIORITY1</name>
              <description>PRIORITY1</description>
              <bitOffset>11</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>PRIORITY2</name>
              <description>PRIORITY2</description>
              <bitOffset>19</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>PRIORITY3</name>
              <description>PRIORITY3</description>
              <bitOffset>27</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GICD_IPRIORITYR61</name>
          <displayName>GICD_IPRIORITYR61</displayName>
          <description>GICD interrupt priority register 61</description>
          <addressOffset>0x4F4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PRIORITY0</name>
              <description>PRIORITY0</description>
              <bitOffset>3</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>PRIORITY1</name>
              <description>PRIORITY1</description>
              <bitOffset>11</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>PRIORITY2</name>
              <description>PRIORITY2</description>
              <bitOffset>19</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>PRIORITY3</name>
              <description>PRIORITY3</description>
              <bitOffset>27</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GICD_IPRIORITYR62</name>
          <displayName>GICD_IPRIORITYR62</displayName>
          <description>GICD interrupt priority register 62</description>
          <addressOffset>0x4F8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PRIORITY0</name>
              <description>PRIORITY0</description>
              <bitOffset>3</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>PRIORITY1</name>
              <description>PRIORITY1</description>
              <bitOffset>11</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>PRIORITY2</name>
              <description>PRIORITY2</description>
              <bitOffset>19</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>PRIORITY3</name>
              <description>PRIORITY3</description>
              <bitOffset>27</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GICD_IPRIORITYR63</name>
          <displayName>GICD_IPRIORITYR63</displayName>
          <description>GICD interrupt priority register 63</description>
          <addressOffset>0x4FC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PRIORITY0</name>
              <description>PRIORITY0</description>
              <bitOffset>3</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>PRIORITY1</name>
              <description>PRIORITY1</description>
              <bitOffset>11</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>PRIORITY2</name>
              <description>PRIORITY2</description>
              <bitOffset>19</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>PRIORITY3</name>
              <description>PRIORITY3</description>
              <bitOffset>27</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GICD_IPRIORITYR64</name>
          <displayName>GICD_IPRIORITYR64</displayName>
          <description>GICD interrupt priority register 64</description>
          <addressOffset>0x500</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PRIORITY0</name>
              <description>PRIORITY0</description>
              <bitOffset>3</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>PRIORITY1</name>
              <description>PRIORITY1</description>
              <bitOffset>11</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>PRIORITY2</name>
              <description>PRIORITY2</description>
              <bitOffset>19</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>PRIORITY3</name>
              <description>PRIORITY3</description>
              <bitOffset>27</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GICD_IPRIORITYR65</name>
          <displayName>GICD_IPRIORITYR65</displayName>
          <description>GICD interrupt priority register 65</description>
          <addressOffset>0x504</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PRIORITY0</name>
              <description>PRIORITY0</description>
              <bitOffset>3</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>PRIORITY1</name>
              <description>PRIORITY1</description>
              <bitOffset>11</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>PRIORITY2</name>
              <description>PRIORITY2</description>
              <bitOffset>19</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>PRIORITY3</name>
              <description>PRIORITY3</description>
              <bitOffset>27</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GICD_IPRIORITYR66</name>
          <displayName>GICD_IPRIORITYR66</displayName>
          <description>GICD interrupt priority register 66</description>
          <addressOffset>0x508</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PRIORITY0</name>
              <description>PRIORITY0</description>
              <bitOffset>3</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>PRIORITY1</name>
              <description>PRIORITY1</description>
              <bitOffset>11</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>PRIORITY2</name>
              <description>PRIORITY2</description>
              <bitOffset>19</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>PRIORITY3</name>
              <description>PRIORITY3</description>
              <bitOffset>27</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GICD_IPRIORITYR67</name>
          <displayName>GICD_IPRIORITYR67</displayName>
          <description>GICD interrupt priority register 67</description>
          <addressOffset>0x50C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PRIORITY0</name>
              <description>PRIORITY0</description>
              <bitOffset>3</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>PRIORITY1</name>
              <description>PRIORITY1</description>
              <bitOffset>11</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>PRIORITY2</name>
              <description>PRIORITY2</description>
              <bitOffset>19</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>PRIORITY3</name>
              <description>PRIORITY3</description>
              <bitOffset>27</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GICD_IPRIORITYR68</name>
          <displayName>GICD_IPRIORITYR68</displayName>
          <description>GICD interrupt priority register 68</description>
          <addressOffset>0x510</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PRIORITY0</name>
              <description>PRIORITY0</description>
              <bitOffset>3</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>PRIORITY1</name>
              <description>PRIORITY1</description>
              <bitOffset>11</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>PRIORITY2</name>
              <description>PRIORITY2</description>
              <bitOffset>19</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>PRIORITY3</name>
              <description>PRIORITY3</description>
              <bitOffset>27</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GICD_IPRIORITYR69</name>
          <displayName>GICD_IPRIORITYR69</displayName>
          <description>GICD interrupt priority register 69</description>
          <addressOffset>0x514</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PRIORITY0</name>
              <description>PRIORITY0</description>
              <bitOffset>3</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>PRIORITY1</name>
              <description>PRIORITY1</description>
              <bitOffset>11</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>PRIORITY2</name>
              <description>PRIORITY2</description>
              <bitOffset>19</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>PRIORITY3</name>
              <description>PRIORITY3</description>
              <bitOffset>27</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GICD_IPRIORITYR70</name>
          <displayName>GICD_IPRIORITYR70</displayName>
          <description>GICD interrupt priority register 70</description>
          <addressOffset>0x518</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PRIORITY0</name>
              <description>PRIORITY0</description>
              <bitOffset>3</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>PRIORITY1</name>
              <description>PRIORITY1</description>
              <bitOffset>11</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>PRIORITY2</name>
              <description>PRIORITY2</description>
              <bitOffset>19</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>PRIORITY3</name>
              <description>PRIORITY3</description>
              <bitOffset>27</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GICD_IPRIORITYR71</name>
          <displayName>GICD_IPRIORITYR71</displayName>
          <description>GICD interrupt priority register 71</description>
          <addressOffset>0x51C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PRIORITY0</name>
              <description>PRIORITY0</description>
              <bitOffset>3</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>PRIORITY1</name>
              <description>PRIORITY1</description>
              <bitOffset>11</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>PRIORITY2</name>
              <description>PRIORITY2</description>
              <bitOffset>19</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>PRIORITY3</name>
              <description>PRIORITY3</description>
              <bitOffset>27</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GICD_ITARGETSR0</name>
          <displayName>GICD_ITARGETSR0</displayName>
          <description>For existing SGIs and PPIs, read of CPU targets field returns the number of the processor performing the read.</description>
          <addressOffset>0x800</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CPU_TARGETS0</name>
              <description>CPU_TARGETS0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CPU_TARGETS1</name>
              <description>CPU_TARGETS1</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CPU_TARGETS2</name>
              <description>CPU_TARGETS2</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CPU_TARGETS3</name>
              <description>CPU_TARGETS3</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GICD_ITARGETSR1</name>
          <displayName>GICD_ITARGETSR1</displayName>
          <description>For existing SGIs and PPIs, read of CPU targets field returns the number of the processor performing the read.</description>
          <addressOffset>0x804</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CPU_TARGETS0</name>
              <description>CPU_TARGETS0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CPU_TARGETS1</name>
              <description>CPU_TARGETS1</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CPU_TARGETS2</name>
              <description>CPU_TARGETS2</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CPU_TARGETS3</name>
              <description>CPU_TARGETS3</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GICD_ITARGETSR2</name>
          <displayName>GICD_ITARGETSR2</displayName>
          <description>For existing SGIs and PPIs, read of CPU targets field returns the number of the processor performing the read.</description>
          <addressOffset>0x808</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CPU_TARGETS0</name>
              <description>CPU_TARGETS0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CPU_TARGETS1</name>
              <description>CPU_TARGETS1</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CPU_TARGETS2</name>
              <description>CPU_TARGETS2</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CPU_TARGETS3</name>
              <description>CPU_TARGETS3</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GICD_ITARGETSR3</name>
          <displayName>GICD_ITARGETSR3</displayName>
          <description>For existing SGIs and PPIs, read of CPU targets field returns the number of the processor performing the read.</description>
          <addressOffset>0x80C</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CPU_TARGETS0</name>
              <description>CPU_TARGETS0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CPU_TARGETS1</name>
              <description>CPU_TARGETS1</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CPU_TARGETS2</name>
              <description>CPU_TARGETS2</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CPU_TARGETS3</name>
              <description>CPU_TARGETS3</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GICD_ITARGETSR4</name>
          <displayName>GICD_ITARGETSR4</displayName>
          <description>For existing SGIs and PPIs, read of CPU targets field returns the number of the processor performing the read.</description>
          <addressOffset>0x810</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CPU_TARGETS0</name>
              <description>CPU_TARGETS0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CPU_TARGETS1</name>
              <description>CPU_TARGETS1</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CPU_TARGETS2</name>
              <description>CPU_TARGETS2</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CPU_TARGETS3</name>
              <description>CPU_TARGETS3</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
