henri-32/esp32-tiller-autopilot/.pio-core/platforms/ststm32/misc/svd/STM32MP153x.svd
        <register>
          <name>GICD_ITARGETSR5</name>
          <displayName>GICD_ITARGETSR5</displayName>
          <description>For existing SGIs and PPIs, read of CPU targets field returns the number of the processor performing the read.</description>
          <addressOffset>0x814</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CPU_TARGETS0</name>
              <description>CPU_TARGETS0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CPU_TARGETS1</name>
              <description>CPU_TARGETS1</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CPU_TARGETS2</name>
              <description>CPU_TARGETS2</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CPU_TARGETS3</name>
              <description>CPU_TARGETS3</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GICD_ITARGETSR6</name>
          <displayName>GICD_ITARGETSR6</displayName>
          <description>For existing SGIs and PPIs, read of CPU targets field returns the number of the processor performing the read.</description>
          <addressOffset>0x818</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CPU_TARGETS0</name>
              <description>CPU_TARGETS0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CPU_TARGETS1</name>
              <description>CPU_TARGETS1</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CPU_TARGETS2</name>
              <description>CPU_TARGETS2</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CPU_TARGETS3</name>
              <description>CPU_TARGETS3</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GICD_ITARGETSR7</name>
          <displayName>GICD_ITARGETSR7</displayName>
          <description>For existing SGIs and PPIs, read of CPU targets field returns the number of the processor performing the read.</description>
          <addressOffset>0x81C</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CPU_TARGETS0</name>
              <description>CPU_TARGETS0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CPU_TARGETS1</name>
              <description>CPU_TARGETS1</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CPU_TARGETS2</name>
              <description>CPU_TARGETS2</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CPU_TARGETS3</name>
              <description>CPU_TARGETS3</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GICD_ITARGETSR8</name>
          <displayName>GICD_ITARGETSR8</displayName>
          <description>GICD interrupt processor target register 8</description>
          <addressOffset>0x820</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CPU_TARGETS0</name>
              <description>CPU_TARGETS0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CPU_TARGETS1</name>
              <description>CPU_TARGETS1</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CPU_TARGETS2</name>
              <description>CPU_TARGETS2</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CPU_TARGETS3</name>
              <description>CPU_TARGETS3</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GICD_ITARGETSR9</name>
          <displayName>GICD_ITARGETSR9</displayName>
          <description>GICD interrupt processor target register 9</description>
          <addressOffset>0x824</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CPU_TARGETS0</name>
              <description>CPU_TARGETS0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CPU_TARGETS1</name>
              <description>CPU_TARGETS1</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CPU_TARGETS2</name>
              <description>CPU_TARGETS2</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CPU_TARGETS3</name>
              <description>CPU_TARGETS3</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GICD_ITARGETSR10</name>
          <displayName>GICD_ITARGETSR10</displayName>
          <description>GICD interrupt processor target register 10</description>
          <addressOffset>0x828</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CPU_TARGETS0</name>
              <description>CPU_TARGETS0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CPU_TARGETS1</name>
              <description>CPU_TARGETS1</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CPU_TARGETS2</name>
              <description>CPU_TARGETS2</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CPU_TARGETS3</name>
              <description>CPU_TARGETS3</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GICD_ITARGETSR11</name>
          <displayName>GICD_ITARGETSR11</displayName>
          <description>GICD interrupt processor target register 11</description>
          <addressOffset>0x82C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CPU_TARGETS0</name>
              <description>CPU_TARGETS0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CPU_TARGETS1</name>
              <description>CPU_TARGETS1</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CPU_TARGETS2</name>
              <description>CPU_TARGETS2</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CPU_TARGETS3</name>
              <description>CPU_TARGETS3</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GICD_ITARGETSR12</name>
          <displayName>GICD_ITARGETSR12</displayName>
          <description>GICD interrupt processor target register 12</description>
          <addressOffset>0x830</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CPU_TARGETS0</name>
              <description>CPU_TARGETS0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CPU_TARGETS1</name>
              <description>CPU_TARGETS1</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CPU_TARGETS2</name>
              <description>CPU_TARGETS2</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CPU_TARGETS3</name>
              <description>CPU_TARGETS3</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GICD_ITARGETSR13</name>
          <displayName>GICD_ITARGETSR13</displayName>
          <description>GICD interrupt processor target register 13</description>
          <addressOffset>0x834</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CPU_TARGETS0</name>
              <description>CPU_TARGETS0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CPU_TARGETS1</name>
              <description>CPU_TARGETS1</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CPU_TARGETS2</name>
              <description>CPU_TARGETS2</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CPU_TARGETS3</name>
              <description>CPU_TARGETS3</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GICD_ITARGETSR14</name>
          <displayName>GICD_ITARGETSR14</displayName>
          <description>GICD interrupt processor target register 14</description>
          <addressOffset>0x838</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CPU_TARGETS0</name>
              <description>CPU_TARGETS0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CPU_TARGETS1</name>
              <description>CPU_TARGETS1</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CPU_TARGETS2</name>
              <description>CPU_TARGETS2</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CPU_TARGETS3</name>
              <description>CPU_TARGETS3</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GICD_ITARGETSR15</name>
          <displayName>GICD_ITARGETSR15</displayName>
          <description>GICD interrupt processor target register 15</description>
          <addressOffset>0x83C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CPU_TARGETS0</name>
              <description>CPU_TARGETS0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CPU_TARGETS1</name>
              <description>CPU_TARGETS1</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CPU_TARGETS2</name>
              <description>CPU_TARGETS2</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CPU_TARGETS3</name>
              <description>CPU_TARGETS3</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GICD_ITARGETSR16</name>
          <displayName>GICD_ITARGETSR16</displayName>
          <description>GICD interrupt processor target register 16</description>
          <addressOffset>0x840</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CPU_TARGETS0</name>
              <description>CPU_TARGETS0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CPU_TARGETS1</name>
              <description>CPU_TARGETS1</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CPU_TARGETS2</name>
              <description>CPU_TARGETS2</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CPU_TARGETS3</name>
              <description>CPU_TARGETS3</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GICD_ITARGETSR17</name>
          <displayName>GICD_ITARGETSR17</displayName>
          <description>GICD interrupt processor target register 17</description>
          <addressOffset>0x844</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CPU_TARGETS0</name>
              <description>CPU_TARGETS0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CPU_TARGETS1</name>
              <description>CPU_TARGETS1</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CPU_TARGETS2</name>
              <description>CPU_TARGETS2</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CPU_TARGETS3</name>
              <description>CPU_TARGETS3</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GICD_ITARGETSR18</name>
          <displayName>GICD_ITARGETSR18</displayName>
          <description>GICD interrupt processor target register 18</description>
          <addressOffset>0x848</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CPU_TARGETS0</name>
              <description>CPU_TARGETS0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CPU_TARGETS1</name>
              <description>CPU_TARGETS1</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CPU_TARGETS2</name>
              <description>CPU_TARGETS2</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CPU_TARGETS3</name>
              <description>CPU_TARGETS3</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GICD_ITARGETSR19</name>
          <displayName>GICD_ITARGETSR19</displayName>
          <description>GICD interrupt processor target register 19</description>
          <addressOffset>0x84C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CPU_TARGETS0</name>
              <description>CPU_TARGETS0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CPU_TARGETS1</name>
              <description>CPU_TARGETS1</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CPU_TARGETS2</name>
              <description>CPU_TARGETS2</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CPU_TARGETS3</name>
              <description>CPU_TARGETS3</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GICD_ITARGETSR20</name>
          <displayName>GICD_ITARGETSR20</displayName>
          <description>GICD interrupt processor target register 20</description>
          <addressOffset>0x850</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CPU_TARGETS0</name>
              <description>CPU_TARGETS0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CPU_TARGETS1</name>
              <description>CPU_TARGETS1</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CPU_TARGETS2</name>
              <description>CPU_TARGETS2</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CPU_TARGETS3</name>
              <description>CPU_TARGETS3</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GICD_ITARGETSR21</name>
          <displayName>GICD_ITARGETSR21</displayName>
          <description>GICD interrupt processor target register 21</description>
          <addressOffset>0x854</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CPU_TARGETS0</name>
              <description>CPU_TARGETS0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CPU_TARGETS1</name>
              <description>CPU_TARGETS1</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CPU_TARGETS2</name>
              <description>CPU_TARGETS2</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CPU_TARGETS3</name>
              <description>CPU_TARGETS3</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GICD_ITARGETSR22</name>
          <displayName>GICD_ITARGETSR22</displayName>
          <description>GICD interrupt processor target register 22</description>
          <addressOffset>0x858</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CPU_TARGETS0</name>
              <description>CPU_TARGETS0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CPU_TARGETS1</name>
              <description>CPU_TARGETS1</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CPU_TARGETS2</name>
              <description>CPU_TARGETS2</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CPU_TARGETS3</name>
              <description>CPU_TARGETS3</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
