henri-32/esp32-tiller-autopilot/.pio-core/platforms/ststm32/misc/svd/STM32MP153x.svd
        <register>
          <name>GICD_ITARGETSR23</name>
          <displayName>GICD_ITARGETSR23</displayName>
          <description>GICD interrupt processor target register 23</description>
          <addressOffset>0x85C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CPU_TARGETS0</name>
              <description>CPU_TARGETS0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CPU_TARGETS1</name>
              <description>CPU_TARGETS1</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CPU_TARGETS2</name>
              <description>CPU_TARGETS2</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CPU_TARGETS3</name>
              <description>CPU_TARGETS3</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GICD_ITARGETSR24</name>
          <displayName>GICD_ITARGETSR24</displayName>
          <description>GICD interrupt processor target register 24</description>
          <addressOffset>0x860</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CPU_TARGETS0</name>
              <description>CPU_TARGETS0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CPU_TARGETS1</name>
              <description>CPU_TARGETS1</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CPU_TARGETS2</name>
              <description>CPU_TARGETS2</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CPU_TARGETS3</name>
              <description>CPU_TARGETS3</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GICD_ITARGETSR25</name>
          <displayName>GICD_ITARGETSR25</displayName>
          <description>GICD interrupt processor target register 25</description>
          <addressOffset>0x864</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CPU_TARGETS0</name>
              <description>CPU_TARGETS0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CPU_TARGETS1</name>
              <description>CPU_TARGETS1</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CPU_TARGETS2</name>
              <description>CPU_TARGETS2</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CPU_TARGETS3</name>
              <description>CPU_TARGETS3</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GICD_ITARGETSR26</name>
          <displayName>GICD_ITARGETSR26</displayName>
          <description>GICD interrupt processor target register 26</description>
          <addressOffset>0x868</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CPU_TARGETS0</name>
              <description>CPU_TARGETS0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CPU_TARGETS1</name>
              <description>CPU_TARGETS1</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CPU_TARGETS2</name>
              <description>CPU_TARGETS2</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CPU_TARGETS3</name>
              <description>CPU_TARGETS3</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GICD_ITARGETSR27</name>
          <displayName>GICD_ITARGETSR27</displayName>
          <description>GICD interrupt processor target register 27</description>
          <addressOffset>0x86C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CPU_TARGETS0</name>
              <description>CPU_TARGETS0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CPU_TARGETS1</name>
              <description>CPU_TARGETS1</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CPU_TARGETS2</name>
              <description>CPU_TARGETS2</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CPU_TARGETS3</name>
              <description>CPU_TARGETS3</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GICD_ITARGETSR28</name>
          <displayName>GICD_ITARGETSR28</displayName>
          <description>GICD interrupt processor target register 28</description>
          <addressOffset>0x870</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CPU_TARGETS0</name>
              <description>CPU_TARGETS0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CPU_TARGETS1</name>
              <description>CPU_TARGETS1</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CPU_TARGETS2</name>
              <description>CPU_TARGETS2</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CPU_TARGETS3</name>
              <description>CPU_TARGETS3</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GICD_ITARGETSR29</name>
          <displayName>GICD_ITARGETSR29</displayName>
          <description>GICD interrupt processor target register 29</description>
          <addressOffset>0x874</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CPU_TARGETS0</name>
              <description>CPU_TARGETS0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CPU_TARGETS1</name>
              <description>CPU_TARGETS1</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CPU_TARGETS2</name>
              <description>CPU_TARGETS2</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CPU_TARGETS3</name>
              <description>CPU_TARGETS3</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GICD_ITARGETSR30</name>
          <displayName>GICD_ITARGETSR30</displayName>
          <description>GICD interrupt processor target register 30</description>
          <addressOffset>0x878</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CPU_TARGETS0</name>
              <description>CPU_TARGETS0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CPU_TARGETS1</name>
              <description>CPU_TARGETS1</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CPU_TARGETS2</name>
              <description>CPU_TARGETS2</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CPU_TARGETS3</name>
              <description>CPU_TARGETS3</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GICD_ITARGETSR31</name>
          <displayName>GICD_ITARGETSR31</displayName>
          <description>GICD interrupt processor target register 31</description>
          <addressOffset>0x87C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CPU_TARGETS0</name>
              <description>CPU_TARGETS0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CPU_TARGETS1</name>
              <description>CPU_TARGETS1</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CPU_TARGETS2</name>
              <description>CPU_TARGETS2</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CPU_TARGETS3</name>
              <description>CPU_TARGETS3</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GICD_ITARGETSR32</name>
          <displayName>GICD_ITARGETSR32</displayName>
          <description>GICD interrupt processor target register 32</description>
          <addressOffset>0x880</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CPU_TARGETS0</name>
              <description>CPU_TARGETS0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CPU_TARGETS1</name>
              <description>CPU_TARGETS1</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CPU_TARGETS2</name>
              <description>CPU_TARGETS2</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CPU_TARGETS3</name>
              <description>CPU_TARGETS3</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GICD_ITARGETSR33</name>
          <displayName>GICD_ITARGETSR33</displayName>
          <description>GICD interrupt processor target register 33</description>
          <addressOffset>0x884</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CPU_TARGETS0</name>
              <description>CPU_TARGETS0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CPU_TARGETS1</name>
              <description>CPU_TARGETS1</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CPU_TARGETS2</name>
              <description>CPU_TARGETS2</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CPU_TARGETS3</name>
              <description>CPU_TARGETS3</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GICD_ITARGETSR34</name>
          <displayName>GICD_ITARGETSR34</displayName>
          <description>GICD interrupt processor target register 34</description>
          <addressOffset>0x888</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CPU_TARGETS0</name>
              <description>CPU_TARGETS0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CPU_TARGETS1</name>
              <description>CPU_TARGETS1</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CPU_TARGETS2</name>
              <description>CPU_TARGETS2</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CPU_TARGETS3</name>
              <description>CPU_TARGETS3</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GICD_ITARGETSR35</name>
          <displayName>GICD_ITARGETSR35</displayName>
          <description>GICD interrupt processor target register 35</description>
          <addressOffset>0x88C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CPU_TARGETS0</name>
              <description>CPU_TARGETS0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CPU_TARGETS1</name>
              <description>CPU_TARGETS1</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CPU_TARGETS2</name>
              <description>CPU_TARGETS2</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CPU_TARGETS3</name>
              <description>CPU_TARGETS3</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GICD_ITARGETSR36</name>
          <displayName>GICD_ITARGETSR36</displayName>
          <description>GICD interrupt processor target register 36</description>
          <addressOffset>0x890</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CPU_TARGETS0</name>
              <description>CPU_TARGETS0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CPU_TARGETS1</name>
              <description>CPU_TARGETS1</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CPU_TARGETS2</name>
              <description>CPU_TARGETS2</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CPU_TARGETS3</name>
              <description>CPU_TARGETS3</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GICD_ITARGETSR37</name>
          <displayName>GICD_ITARGETSR37</displayName>
          <description>GICD interrupt processor target register 37</description>
          <addressOffset>0x894</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CPU_TARGETS0</name>
              <description>CPU_TARGETS0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CPU_TARGETS1</name>
              <description>CPU_TARGETS1</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CPU_TARGETS2</name>
              <description>CPU_TARGETS2</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CPU_TARGETS3</name>
              <description>CPU_TARGETS3</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GICD_ITARGETSR38</name>
          <displayName>GICD_ITARGETSR38</displayName>
          <description>GICD interrupt processor target register 38</description>
          <addressOffset>0x898</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CPU_TARGETS0</name>
              <description>CPU_TARGETS0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CPU_TARGETS1</name>
              <description>CPU_TARGETS1</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CPU_TARGETS2</name>
              <description>CPU_TARGETS2</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CPU_TARGETS3</name>
              <description>CPU_TARGETS3</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GICD_ITARGETSR39</name>
          <displayName>GICD_ITARGETSR39</displayName>
          <description>GICD interrupt processor target register 39</description>
          <addressOffset>0x89C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CPU_TARGETS0</name>
              <description>CPU_TARGETS0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CPU_TARGETS1</name>
              <description>CPU_TARGETS1</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CPU_TARGETS2</name>
              <description>CPU_TARGETS2</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CPU_TARGETS3</name>
              <description>CPU_TARGETS3</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GICD_ITARGETSR40</name>
          <displayName>GICD_ITARGETSR40</displayName>
          <description>GICD interrupt processor target register 40</description>
          <addressOffset>0x8A0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CPU_TARGETS0</name>
              <description>CPU_TARGETS0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CPU_TARGETS1</name>
              <description>CPU_TARGETS1</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CPU_TARGETS2</name>
              <description>CPU_TARGETS2</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CPU_TARGETS3</name>
              <description>CPU_TARGETS3</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GICD_ITARGETSR41</name>
          <displayName>GICD_ITARGETSR41</displayName>
          <description>GICD interrupt processor target register 41</description>
          <addressOffset>0x8A4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CPU_TARGETS0</name>
              <description>CPU_TARGETS0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CPU_TARGETS1</name>
              <description>CPU_TARGETS1</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CPU_TARGETS2</name>
              <description>CPU_TARGETS2</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CPU_TARGETS3</name>
              <description>CPU_TARGETS3</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
