henri-32/esp32-tiller-autopilot/.pio-core/platforms/ststm32/misc/svd/STM32MP153x.svd
        <register>
          <name>GICD_ICFGR2</name>
          <displayName>GICD_ICFGR2</displayName>
          <description>GICD interrupt configuration register 2</description>
          <addressOffset>0xC08</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x55555555</resetValue>
          <fields>
            <field>
              <name>INT_CONFIG0</name>
              <description>INT_CONFIG0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>INT_CONFIG1</name>
              <description>INT_CONFIG1</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>INT_CONFIG2</name>
              <description>INT_CONFIG2</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>INT_CONFIG3</name>
              <description>INT_CONFIG3</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>INT_CONFIG4</name>
              <description>INT_CONFIG4</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>INT_CONFIG5</name>
              <description>INT_CONFIG5</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>INT_CONFIG6</name>
              <description>INT_CONFIG6</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>INT_CONFIG7</name>
              <description>INT_CONFIG7</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>INT_CONFIG8</name>
              <description>INT_CONFIG8</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>INT_CONFIG9</name>
              <description>INT_CONFIG9</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>INT_CONFIG10</name>
              <description>INT_CONFIG10</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>INT_CONFIG11</name>
              <description>INT_CONFIG11</description>
              <bitOffset>22</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>INT_CONFIG12</name>
              <description>INT_CONFIG12</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>INT_CONFIG13</name>
              <description>INT_CONFIG13</description>
              <bitOffset>26</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>INT_CONFIG14</name>
              <description>INT_CONFIG14</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>INT_CONFIG15</name>
              <description>INT_CONFIG15</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GICD_ICFGR3</name>
          <displayName>GICD_ICFGR3</displayName>
          <description>GICD interrupt configuration register 3</description>
          <addressOffset>0xC0C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x55555555</resetValue>
          <fields>
            <field>
              <name>INT_CONFIG0</name>
              <description>INT_CONFIG0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>INT_CONFIG1</name>
              <description>INT_CONFIG1</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>INT_CONFIG2</name>
              <description>INT_CONFIG2</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>INT_CONFIG3</name>
              <description>INT_CONFIG3</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>INT_CONFIG4</name>
              <description>INT_CONFIG4</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>INT_CONFIG5</name>
              <description>INT_CONFIG5</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>INT_CONFIG6</name>
              <description>INT_CONFIG6</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>INT_CONFIG7</name>
              <description>INT_CONFIG7</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>INT_CONFIG8</name>
              <description>INT_CONFIG8</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>INT_CONFIG9</name>
              <description>INT_CONFIG9</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>INT_CONFIG10</name>
              <description>INT_CONFIG10</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>INT_CONFIG11</name>
              <description>INT_CONFIG11</description>
              <bitOffset>22</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>INT_CONFIG12</name>
              <description>INT_CONFIG12</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>INT_CONFIG13</name>
              <description>INT_CONFIG13</description>
              <bitOffset>26</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>INT_CONFIG14</name>
              <description>INT_CONFIG14</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>INT_CONFIG15</name>
              <description>INT_CONFIG15</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GICD_ICFGR4</name>
          <displayName>GICD_ICFGR4</displayName>
          <description>GICD interrupt configuration register 4</description>
          <addressOffset>0xC10</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x55555555</resetValue>
          <fields>
            <field>
              <name>INT_CONFIG0</name>
              <description>INT_CONFIG0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>INT_CONFIG1</name>
              <description>INT_CONFIG1</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>INT_CONFIG2</name>
              <description>INT_CONFIG2</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>INT_CONFIG3</name>
              <description>INT_CONFIG3</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>INT_CONFIG4</name>
              <description>INT_CONFIG4</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>INT_CONFIG5</name>
              <description>INT_CONFIG5</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>INT_CONFIG6</name>
              <description>INT_CONFIG6</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>INT_CONFIG7</name>
              <description>INT_CONFIG7</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>INT_CONFIG8</name>
              <description>INT_CONFIG8</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>INT_CONFIG9</name>
              <description>INT_CONFIG9</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>INT_CONFIG10</name>
              <description>INT_CONFIG10</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>INT_CONFIG11</name>
              <description>INT_CONFIG11</description>
              <bitOffset>22</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>INT_CONFIG12</name>
              <description>INT_CONFIG12</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>INT_CONFIG13</name>
              <description>INT_CONFIG13</description>
              <bitOffset>26</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>INT_CONFIG14</name>
              <description>INT_CONFIG14</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>INT_CONFIG15</name>
              <description>INT_CONFIG15</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GICD_ICFGR5</name>
          <displayName>GICD_ICFGR5</displayName>
          <description>GICD interrupt configuration register 5</description>
          <addressOffset>0xC14</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x55555555</resetValue>
          <fields>
            <field>
              <name>INT_CONFIG0</name>
              <description>INT_CONFIG0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>INT_CONFIG1</name>
              <description>INT_CONFIG1</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>INT_CONFIG2</name>
              <description>INT_CONFIG2</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>INT_CONFIG3</name>
              <description>INT_CONFIG3</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>INT_CONFIG4</name>
              <description>INT_CONFIG4</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>INT_CONFIG5</name>
              <description>INT_CONFIG5</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>INT_CONFIG6</name>
              <description>INT_CONFIG6</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>INT_CONFIG7</name>
              <description>INT_CONFIG7</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>INT_CONFIG8</name>
              <description>INT_CONFIG8</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>INT_CONFIG9</name>
              <description>INT_CONFIG9</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>INT_CONFIG10</name>
              <description>INT_CONFIG10</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>INT_CONFIG11</name>
              <description>INT_CONFIG11</description>
              <bitOffset>22</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>INT_CONFIG12</name>
              <description>INT_CONFIG12</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>INT_CONFIG13</name>
              <description>INT_CONFIG13</description>
              <bitOffset>26</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>INT_CONFIG14</name>
              <description>INT_CONFIG14</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>INT_CONFIG15</name>
              <description>INT_CONFIG15</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GICD_ICFGR6</name>
          <displayName>GICD_ICFGR6</displayName>
          <description>GICD interrupt configuration register 6</description>
          <addressOffset>0xC18</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x55555555</resetValue>
          <fields>
            <field>
              <name>INT_CONFIG0</name>
              <description>INT_CONFIG0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>INT_CONFIG1</name>
              <description>INT_CONFIG1</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>INT_CONFIG2</name>
              <description>INT_CONFIG2</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>INT_CONFIG3</name>
              <description>INT_CONFIG3</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>INT_CONFIG4</name>
              <description>INT_CONFIG4</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>INT_CONFIG5</name>
              <description>INT_CONFIG5</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>INT_CONFIG6</name>
              <description>INT_CONFIG6</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>INT_CONFIG7</name>
              <description>INT_CONFIG7</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>INT_CONFIG8</name>
              <description>INT_CONFIG8</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>INT_CONFIG9</name>
              <description>INT_CONFIG9</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>INT_CONFIG10</name>
              <description>INT_CONFIG10</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>INT_CONFIG11</name>
              <description>INT_CONFIG11</description>
              <bitOffset>22</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>INT_CONFIG12</name>
              <description>INT_CONFIG12</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>INT_CONFIG13</name>
              <description>INT_CONFIG13</description>
              <bitOffset>26</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>INT_CONFIG14</name>
              <description>INT_CONFIG14</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>INT_CONFIG15</name>
              <description>INT_CONFIG15</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GICD_ICFGR7</name>
          <displayName>GICD_ICFGR7</displayName>
          <description>GICD interrupt configuration register 7</description>
          <addressOffset>0xC1C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x55555555</resetValue>
          <fields>
            <field>
              <name>INT_CONFIG0</name>
              <description>INT_CONFIG0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>INT_CONFIG1</name>
              <description>INT_CONFIG1</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>INT_CONFIG2</name>
              <description>INT_CONFIG2</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>INT_CONFIG3</name>
              <description>INT_CONFIG3</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>INT_CONFIG4</name>
              <description>INT_CONFIG4</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>INT_CONFIG5</name>
              <description>INT_CONFIG5</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>INT_CONFIG6</name>
              <description>INT_CONFIG6</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>INT_CONFIG7</name>
              <description>INT_CONFIG7</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>INT_CONFIG8</name>
              <description>INT_CONFIG8</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>INT_CONFIG9</name>
              <description>INT_CONFIG9</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>INT_CONFIG10</name>
              <description>INT_CONFIG10</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>INT_CONFIG11</name>
              <description>INT_CONFIG11</description>
              <bitOffset>22</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>INT_CONFIG12</name>
              <description>INT_CONFIG12</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>INT_CONFIG13</name>
              <description>INT_CONFIG13</description>
              <bitOffset>26</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>INT_CONFIG14</name>
              <description>INT_CONFIG14</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>INT_CONFIG15</name>
              <description>INT_CONFIG15</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
