henri-32/esp32-tiller-autopilot/.pio-core/platforms/ststm32/misc/svd/STM32MP153x.svd
        <register>
          <name>GICD_CPENDSGIR1</name>
          <displayName>GICD_CPENDSGIR1</displayName>
          <description>For SGI x*4 to SGI x*4+3</description>
          <addressOffset>0xF14</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SGI_CLEAR_PENDING0</name>
              <description>SGI_CLEAR_PENDING0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>SGI_CLEAR_PENDING1</name>
              <description>SGI_CLEAR_PENDING1</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>SGI_CLEAR_PENDING2</name>
              <description>SGI_CLEAR_PENDING2</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>SGI_CLEAR_PENDING3</name>
              <description>SGI_CLEAR_PENDING3</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GICD_CPENDSGIR2</name>
          <displayName>GICD_CPENDSGIR2</displayName>
          <description>For SGI x*4 to SGI x*4+3</description>
          <addressOffset>0xF18</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SGI_CLEAR_PENDING0</name>
              <description>SGI_CLEAR_PENDING0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>SGI_CLEAR_PENDING1</name>
              <description>SGI_CLEAR_PENDING1</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>SGI_CLEAR_PENDING2</name>
              <description>SGI_CLEAR_PENDING2</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>SGI_CLEAR_PENDING3</name>
              <description>SGI_CLEAR_PENDING3</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GICD_CPENDSGIR3</name>
          <displayName>GICD_CPENDSGIR3</displayName>
          <description>For SGI x*4 to SGI x*4+3</description>
          <addressOffset>0xF1C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SGI_CLEAR_PENDING0</name>
              <description>SGI_CLEAR_PENDING0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>SGI_CLEAR_PENDING1</name>
              <description>SGI_CLEAR_PENDING1</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>SGI_CLEAR_PENDING2</name>
              <description>SGI_CLEAR_PENDING2</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>SGI_CLEAR_PENDING3</name>
              <description>SGI_CLEAR_PENDING3</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GICD_SPENDSGIR0</name>
          <displayName>GICD_SPENDSGIR0</displayName>
          <description>For SGI x*4 to SGI x*4+3</description>
          <addressOffset>0xF20</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SGI_SET_PENDING0</name>
              <description>SGI_SET_PENDING0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>SGI_SET_PENDING1</name>
              <description>SGI_SET_PENDING1</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>SGI_SET_PENDING2</name>
              <description>SGI_SET_PENDING2</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>SGI_SET_PENDING3</name>
              <description>SGI_SET_PENDING3</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GICD_SPENDSGIR1</name>
          <displayName>GICD_SPENDSGIR1</displayName>
          <description>For SGI x*4 to SGI x*4+3</description>
          <addressOffset>0xF24</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SGI_SET_PENDING0</name>
              <description>SGI_SET_PENDING0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>SGI_SET_PENDING1</name>
              <description>SGI_SET_PENDING1</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>SGI_SET_PENDING2</name>
              <description>SGI_SET_PENDING2</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>SGI_SET_PENDING3</name>
              <description>SGI_SET_PENDING3</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GICD_SPENDSGIR2</name>
          <displayName>GICD_SPENDSGIR2</displayName>
          <description>For SGI x*4 to SGI x*4+3</description>
          <addressOffset>0xF28</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SGI_SET_PENDING0</name>
              <description>SGI_SET_PENDING0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>SGI_SET_PENDING1</name>
              <description>SGI_SET_PENDING1</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>SGI_SET_PENDING2</name>
              <description>SGI_SET_PENDING2</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>SGI_SET_PENDING3</name>
              <description>SGI_SET_PENDING3</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GICD_SPENDSGIR3</name>
          <displayName>GICD_SPENDSGIR3</displayName>
          <description>For SGI x*4 to SGI x*4+3</description>
          <addressOffset>0xF2C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SGI_SET_PENDING0</name>
              <description>SGI_SET_PENDING0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>SGI_SET_PENDING1</name>
              <description>SGI_SET_PENDING1</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>SGI_SET_PENDING2</name>
              <description>SGI_SET_PENDING2</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>SGI_SET_PENDING3</name>
              <description>SGI_SET_PENDING3</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GICD_PIDR4</name>
          <displayName>GICD_PIDR4</displayName>
          <description>GICD peripheral ID4 register</description>
          <addressOffset>0xFD0</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000004</resetValue>
          <fields>
            <field>
              <name>PIDR4</name>
              <description>PIDR4</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GICD_PIDR5</name>
          <displayName>GICD_PIDR5</displayName>
          <description>GICD peripheral ID5 to ID7 register 5</description>
          <addressOffset>0xFD4</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PIDR5</name>
              <description>PIDR5</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GICD_PIDR6</name>
          <displayName>GICD_PIDR6</displayName>
          <description>GICD peripheral ID5 to ID7 register 6</description>
          <addressOffset>0xFD8</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PIDR6</name>
              <description>PIDR6</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GICD_PIDR7</name>
          <displayName>GICD_PIDR7</displayName>
          <description>GICD peripheral ID5 to ID7 register 7</description>
          <addressOffset>0xFDC</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PIDR7</name>
              <description>PIDR7</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GICD_PIDR0</name>
          <displayName>GICD_PIDR0</displayName>
          <description>GICD peripheral ID0 register</description>
          <addressOffset>0xFE0</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000090</resetValue>
          <fields>
            <field>
              <name>PIDR0</name>
              <description>PIDR0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GICD_PIDR1</name>
          <displayName>GICD_PIDR1</displayName>
          <description>GICD peripheral ID1 register</description>
          <addressOffset>0xFE4</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x000000B4</resetValue>
          <fields>
            <field>
              <name>PIDR1</name>
              <description>PIDR1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GICD_PIDR2</name>
          <displayName>GICD_PIDR2</displayName>
          <description>GICD peripheral ID2 register</description>
          <addressOffset>0xFE8</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x0000002B</resetValue>
          <fields>
            <field>
              <name>PIDR2</name>
              <description>PIDR2</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GICD_PIDR3</name>
          <displayName>GICD_PIDR3</displayName>
          <description>GICD peripheral ID3 register</description>
          <addressOffset>0xFEC</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PIDR3</name>
              <description>PIDR3</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GICD_CIDR0</name>
          <displayName>GICD_CIDR0</displayName>
          <description>GICD component ID0 register</description>
          <addressOffset>0xFF0</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x0000000D</resetValue>
          <fields>
            <field>
              <name>CIDR0</name>
              <description>CIDR0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GICD_CIDR1</name>
          <displayName>GICD_CIDR1</displayName>
          <description>GICD component ID1 register</description>
          <addressOffset>0xFF4</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x000000F0</resetValue>
          <fields>
            <field>
              <name>CIDR1</name>
              <description>CIDR1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GICD_CIDR2</name>
          <displayName>GICD_CIDR2</displayName>
          <description>GICD component ID2 register</description>
          <addressOffset>0xFF8</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000005</resetValue>
          <fields>
            <field>
              <name>CIDR2</name>
              <description>CIDR2</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GICD_CIDR3</name>
          <displayName>GICD_CIDR3</displayName>
          <description>GICD component ID3 register</description>
          <addressOffset>0xFFC</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x000000B1</resetValue>
          <fields>
            <field>
              <name>CIDR3</name>
              <description>CIDR3</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
