henri-32/esp32-tiller-autopilot/.pio-core/platforms/ststm32/misc/svd/STM32MP153x.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>GICH</name>
      <description>GICH</description>
      <groupName>GICH</groupName>
      <baseAddress>0xA0024000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x2000</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>GICH_HCR</name>
          <displayName>GICH_HCR</displayName>
          <description>GICH hypervisor control register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>EN</name>
              <description>EN</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>UIE</name>
              <description>UIE</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LRENPIE</name>
              <description>LRENPIE</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>NPIE</name>
              <description>NPIE</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>VGRP0EIE</name>
              <description>VGRP0EIE</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>VGRP0DIE</name>
              <description>VGRP0DIE</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>VGRP1EIE</name>
              <description>VGRP1EIE</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>VGRP1DIE</name>
              <description>VGRP1DIE</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EOICOUNT</name>
              <description>EOICOUNT</description>
              <bitOffset>27</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GICH_VTR</name>
          <displayName>GICH_VTR</displayName>
          <description>GICH VGIC type register</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x90000003</resetValue>
          <fields>
            <field>
              <name>LISTREGS</name>
              <description>LISTREGS</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>PREBITS</name>
              <description>PREBITS</description>
              <bitOffset>26</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>PRIBITS</name>
              <description>PRIBITS</description>
              <bitOffset>29</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GICH_VMCR</name>
          <displayName>GICH_VMCR</displayName>
          <description>GICH virtual machine control register</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x004D0000</resetValue>
          <fields>
            <field>
              <name>VMGRP0EN</name>
              <description>VMGRP0EN</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>VMGRP1EN</name>
              <description>VMGRP1EN</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>VMACKCTL</name>
              <description>VMACKCTL</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>VMFIQEN</name>
              <description>VMFIQEN</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>VMCBPR</name>
              <description>VMCBPR</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>VEM</name>
              <description>VEM</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>VMABP</name>
              <description>VMABP</description>
              <bitOffset>18</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>VMBP</name>
              <description>VMBP</description>
              <bitOffset>21</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>VMPRIMASK</name>
              <description>VMPRIMASK</description>
              <bitOffset>27</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GICH_MISR</name>
          <displayName>GICH_MISR</displayName>
          <description>GICH maintenance interrupt status register</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>EOI</name>
              <description>EOI</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>U</name>
              <description>U</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LRENP</name>
              <description>LRENP</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>NP</name>
              <description>NP</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>VGRP0E</name>
              <description>VGRP0E</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>VGRP0D</name>
              <description>VGRP0D</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>VGRP1E</name>
              <description>VGRP1E</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>VGRP1D</name>
              <description>VGRP1D</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GICH_EISR0</name>
          <displayName>GICH_EISR0</displayName>
          <description>GICH end of interrupt status register</description>
          <addressOffset>0x20</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>EISR0</name>
              <description>EISR0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GICH_ELSR0</name>
          <displayName>GICH_ELSR0</displayName>
          <description>GICH empty list status register</description>
          <addressOffset>0x30</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x0000000F</resetValue>
          <fields>
            <field>
              <name>ELSR0</name>
              <description>ELSR0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GICH_APR0</name>
          <displayName>GICH_APR0</displayName>
          <description>GICH active priority register</description>
          <addressOffset>0xF0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>APR0</name>
              <description>APR0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GICH_LR0</name>
          <displayName>GICH_LR0</displayName>
          <description>GICH list register 0</description>
          <addressOffset>0x100</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>VIRTUALID</name>
              <description>VIRTUALID</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
            </field>
            <field>
              <name>PHYSICALID</name>
              <description>PHYSICALID</description>
              <bitOffset>10</bitOffset>
              <bitWidth>10</bitWidth>
            </field>
            <field>
              <name>PRIORITY</name>
              <description>PRIORITY</description>
              <bitOffset>23</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>STATE</name>
              <description>STATE</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>GRP1</name>
              <description>GRP1</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HW</name>
              <description>HW</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GICH_LR1</name>
          <displayName>GICH_LR1</displayName>
          <description>GICH list register 1</description>
          <addressOffset>0x104</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>VIRTUALID</name>
              <description>VIRTUALID</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
            </field>
            <field>
              <name>PHYSICALID</name>
              <description>PHYSICALID</description>
              <bitOffset>10</bitOffset>
              <bitWidth>10</bitWidth>
            </field>
            <field>
              <name>PRIORITY</name>
              <description>PRIORITY</description>
              <bitOffset>23</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>STATE</name>
              <description>STATE</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>GRP1</name>
              <description>GRP1</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HW</name>
              <description>HW</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GICH_LR2</name>
          <displayName>GICH_LR2</displayName>
          <description>GICH list register 2</description>
          <addressOffset>0x108</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>VIRTUALID</name>
              <description>VIRTUALID</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
            </field>
            <field>
              <name>PHYSICALID</name>
              <description>PHYSICALID</description>
              <bitOffset>10</bitOffset>
              <bitWidth>10</bitWidth>
            </field>
            <field>
              <name>PRIORITY</name>
              <description>PRIORITY</description>
              <bitOffset>23</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>STATE</name>
              <description>STATE</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>GRP1</name>
              <description>GRP1</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HW</name>
              <description>HW</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GICH_LR3</name>
          <displayName>GICH_LR3</displayName>
          <description>GICH list register 3</description>
          <addressOffset>0x10C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>VIRTUALID</name>
              <description>VIRTUALID</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
            </field>
            <field>
              <name>PHYSICALID</name>
              <description>PHYSICALID</description>
              <bitOffset>10</bitOffset>
              <bitWidth>10</bitWidth>
            </field>
            <field>
              <name>PRIORITY</name>
              <description>PRIORITY</description>
              <bitOffset>23</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>STATE</name>
              <description>STATE</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>GRP1</name>
              <description>GRP1</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HW</name>
              <description>HW</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
