henri-32/esp32-tiller-autopilot/.pio-core/platforms/ststm32/misc/svd/STM32MP153x.svd
			</registers>
		</peripheral>
	<peripheral>
			<name>RCC</name>
			<description>RCC</description>
			<groupName>RCC</groupName>
			<baseAddress>0x50000000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x1000</size>
				<usage>registers</usage>
			</addressBlock>
	   <interrupt>
        <name>RCC</name>
        <description>RCC global interrupt</description>
        <value>5</value>
      </interrupt>
	  <interrupt>
        <name>RCC_WAKEUP</name>
        <description>RCC MPU wakeup interrupt</description>
        <value>145</value>
      </interrupt>
			<registers>
				<register>
					<name>RCC_TZCR</name>
					<displayName>RCC_TZCR</displayName>
					<description>This register is used to switch the RCC into secure mode. This register can only be accessed in secure mode.</description>
					<addressOffset>0x0</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000003</resetValue>
					<fields>
						<field>
							<name>TZEN</name>
							<description>TZEN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>MCKPROT</name>
							<description>MCKPROT</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>RCC_OCENSETR</name>
					<displayName>RCC_OCENSETR</displayName>
					<description>This register is used to control the oscillators.Writing  to this register has no effect, writing  will set the corresponding bits. Reading will give the effective values of each bit.If TZEN = MCKPROT = , this register can only be modified in secure mode. Write access to this register is not allowed during the clock restore sequence. See Section: The clock restore sequence description for details.</description>
					<addressOffset>0xC</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000001</resetValue>
					<fields>
						<field>
							<name>HSION</name>
							<description>HSION</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>HSIKERON</name>
							<description>HSIKERON</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CSION</name>
							<description>CSION</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CSIKERON</name>
							<description>CSIKERON</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DIGBYP</name>
							<description>DIGBYP</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>HSEON</name>
							<description>HSEON</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>HSEKERON</name>
							<description>HSEKERON</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>HSEBYP</name>
							<description>HSEBYP</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>HSECSSON</name>
							<description>HSECSSON</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>RCC_OCENCLRR</name>
					<displayName>RCC_OCENCLRR</displayName>
					<description>This register is used to control the oscillators.Writing  to this register has no effect, writing  will clear the corresponding bits. Reading will give the effective values of the enable bits.If TZEN = , this register can only be modified in secure mode. Write access to this register is not allowed during the clock restore sequence. See Section: The clock restore sequence description for details.</description>
					<addressOffset>0x10</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000001</resetValue>
					<fields>
						<field>
							<name>HSION</name>
							<description>HSION</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>HSIKERON</name>
							<description>HSIKERON</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CSION</name>
							<description>CSION</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CSIKERON</name>
							<description>CSIKERON</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DIGBYP</name>
							<description>DIGBYP</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>HSEON</name>
							<description>HSEON</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>HSEKERON</name>
							<description>HSEKERON</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>HSEBYP</name>
							<description>HSEBYP</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>RCC_HSICFGR</name>
					<displayName>RCC_HSICFGR</displayName>
					<description>This register is used to configure the HSI. If TZEN = , this register can only be modified in secure mode. Write access to this register is not allowed during the clock restore sequence. See Section: The clock restore sequence description for details.</description>
					<addressOffset>0x18</addressOffset>
					<size>0x20</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>HSIDIV</name>
							<description>HSIDIV</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>HSITRIM</name>
							<description>HSITRIM</description>
							<bitOffset>8</bitOffset>
							<bitWidth>7</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>HSICAL</name>
							<description>HSICAL</description>
							<bitOffset>16</bitOffset>
							<bitWidth>12</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RCC_CSICFGR</name>
					<displayName>RCC_CSICFGR</displayName>
					<description>This register is used to fine-tune the CSI frequency. If TZEN = MCKPROT = , this register can only be modified in secure mode. Write access to this register is not allowed during the clock restore sequence. See The clock restore sequence description for details.</description>
					<addressOffset>0x1C</addressOffset>
					<size>0x20</size>
					<resetValue>0x00001000</resetValue>
					<fields>
						<field>
							<name>CSITRIM</name>
							<description>CSITRIM</description>
							<bitOffset>8</bitOffset>
							<bitWidth>5</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CSICAL</name>
							<description>CSICAL</description>
							<bitOffset>16</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RCC_MPCKSELR</name>
					<displayName>RCC_MPCKSELR</displayName>
					<description>This register is used to select the clock source for the MPU. If TZEN = , this register can only be modified in secure mode. Write access to this register is not allowed during the clock restore sequence. See Section: The clock restore sequence description for details.</description>
					<addressOffset>0x20</addressOffset>
					<size>0x20</size>
					<resetValue>0x80000000</resetValue>
					<fields>
						<field>
							<name>MPUSRC</name>
							<description>MPUSRC</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MPUSRCRDY</name>
							<description>MPUSRCRDY</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RCC_ASSCKSELR</name>
					<displayName>RCC_ASSCKSELR</displayName>
					<description>This register is used to select the clock source for the AXI sub-system. If TZEN = , this register can only be modified in secure mode. Write access to this register is not allowed during the clock restore sequence. See Section: The clock restore sequence description for details.</description>
					<addressOffset>0x24</addressOffset>
					<size>0x20</size>
					<resetValue>0x80000000</resetValue>
					<fields>
						<field>
							<name>AXISSRC</name>
							<description>AXISSRC</description>
							<bitOffset>0</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AXISSRCRDY</name>
							<description>AXISSRCRDY</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RCC_RCK12SELR</name>
					<displayName>RCC_RCK12SELR</displayName>
					<description>This register is used to select the reference clock for PLL1 and PLL2. If TZEN = , this register can only be modified in secure mode. Write access to this register is not allowed during the clock restore sequence. See Section: The clock restore sequence description for details.</description>
					<addressOffset>0x28</addressOffset>
					<size>0x20</size>
					<resetValue>0x80000000</resetValue>
					<fields>
						<field>
							<name>PLL12SRC</name>
							<description>PLL12SRC</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PLL12SRCRDY</name>
							<description>PLL12SRCRDY</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RCC_MPCKDIVR</name>
					<displayName>RCC_MPCKDIVR</displayName>
					<description>This register is used to control the MPU clock prescaler. Refer to Section: Sub-system clock generation for additional information. If TZEN = , this register can only be modified in secure mode.</description>
					<addressOffset>0x2C</addressOffset>
					<size>0x20</size>
					<resetValue>0x80000001</resetValue>
					<fields>
						<field>
							<name>MPUDIV</name>
							<description>MPUDIV</description>
							<bitOffset>0</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MPUDIVRDY</name>
							<description>MPUDIVRDY</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RCC_AXIDIVR</name>
					<displayName>RCC_AXIDIVR</displayName>
					<description>This register is used to control the AXI Matrix clock prescaler. Refer to Section: Sub-system clock generation for additional information. If TZEN = , this register can only be modified in secure mode.</description>
					<addressOffset>0x30</addressOffset>
					<size>0x20</size>
					<resetValue>0x80000000</resetValue>
					<fields>
						<field>
							<name>AXIDIV</name>
							<description>AXIDIV</description>
							<bitOffset>0</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AXIDIVRDY</name>
							<description>AXIDIVRDY</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RCC_APB4DIVR</name>
					<displayName>RCC_APB4DIVR</displayName>
					<description>This register is used to control the APB4 clock divider. Refer to Section: Sub-system clock generation for additional information. If TZEN = , this register can only be modified in secure mode.</description>
					<addressOffset>0x3C</addressOffset>
					<size>0x20</size>
					<resetValue>0x80000000</resetValue>
					<fields>
						<field>
							<name>APB4DIV</name>
							<description>APB4DIV</description>
							<bitOffset>0</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>APB4DIVRDY</name>
							<description>APB4DIVRDY</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RCC_APB5DIVR</name>
					<displayName>RCC_APB5DIVR</displayName>
					<description>This register is used to control the APB5 clock divider. Refer to Section: Sub-system clock generation for additional information. If TZEN = , this register can only be modified in secure mode.</description>
					<addressOffset>0x40</addressOffset>
					<size>0x20</size>
					<resetValue>0x80000000</resetValue>
					<fields>
						<field>
							<name>APB5DIV</name>
							<description>APB5DIV</description>
							<bitOffset>0</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>APB5DIVRDY</name>
							<description>APB5DIVRDY</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RCC_RTCDIVR</name>
					<displayName>RCC_RTCDIVR</displayName>
					<description>This register is used to divide the HSE clock for RTC. If TZEN = , this register can only be modified in secure mode.</description>
					<addressOffset>0x44</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>RTCDIV</name>
							<description>RTCDIV</description>
							<bitOffset>0</bitOffset>
							<bitWidth>6</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>RCC_MSSCKSELR</name>
					<displayName>RCC_MSSCKSELR</displayName>
					<description>This register is used to select the clock source for the MCU sub-system, including the MCU itself. If TZEN = MCKPROT = , this register can only be modified in secure mode. Write access to this register is not allowed during the clock restore sequence. See Section: The clock restore sequence description for details.</description>
					<addressOffset>0x48</addressOffset>
					<size>0x20</size>
					<resetValue>0x80000000</resetValue>
					<fields>
						<field>
							<name>MCUSSRC</name>
							<description>MCUSSRC</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MCUSSRCRDY</name>
							<description>MCUSSRCRDY</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RCC_PLL1CR</name>
					<displayName>RCC_PLL1CR</displayName>
					<description>This register is used to control the PLL1. If TZEN = , this register can only be modified in secure mode. Write access to this register is not allowed during the clock restore sequence. See Section: The clock restore sequence description for details.</description>
					<addressOffset>0x80</addressOffset>
					<size>0x20</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>PLLON</name>
							<description>PLLON</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PLL1RDY</name>
							<description>PLL1RDY</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>SSCG_CTRL</name>
							<description>SSCG_CTRL</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>DIVPEN</name>
							<description>DIVPEN</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>DIVQEN</name>
							<description>DIVQEN</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>DIVREN</name>
							<description>DIVREN</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RCC_PLL1CFGR1</name>
					<displayName>RCC_PLL1CFGR1</displayName>
					<description>This register is used to configure the PLL1. If TZEN = , this register can only be modified in secure mode. Write access to this register is not allowed during the clock restore sequence. See Section: The clock restore sequence description for details.</description>
					<addressOffset>0x84</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00010031</resetValue>
					<fields>
						<field>
							<name>DIVN</name>
							<description>DIVN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>9</bitWidth>
						</field>
						<field>
							<name>DIVM1</name>
							<description>DIVM1</description>
							<bitOffset>16</bitOffset>
							<bitWidth>6</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>RCC_PLL1CFGR2</name>
					<displayName>RCC_PLL1CFGR2</displayName>
					<description>This register is used to configure the PLL1. If TZEN = , this register can only be modified in secure mode. Write access to this register is not allowed during the clock restore sequence. See Section: The clock restore sequence description for details.</description>
					<addressOffset>0x88</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00010100</resetValue>
					<fields>
						<field>
							<name>DIVP</name>
							<description>DIVP</description>
							<bitOffset>0</bitOffset>
							<bitWidth>7</bitWidth>
						</field>
						<field>
							<name>DIVQ</name>
							<description>DIVQ</description>
							<bitOffset>8</bitOffset>
							<bitWidth>7</bitWidth>
						</field>
						<field>
							<name>DIVR</name>
							<description>DIVR</description>
							<bitOffset>16</bitOffset>
							<bitWidth>7</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>RCC_PLL1FRACR</name>
					<displayName>RCC_PLL1FRACR</displayName>
					<description>This register is used to fine-tune the frequency of the PLL1 VCO. If TZEN = , this register can only be modified in secure mode. Write access to this register is not allowed during the clock restore sequence. See Section: The clock restore sequence description for details.</description>
					<addressOffset>0x8C</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>FRACV</name>
							<description>FRACV</description>
							<bitOffset>3</bitOffset>
							<bitWidth>13</bitWidth>
						</field>
						<field>
							<name>FRACLE</name>
							<description>FRACLE</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>RCC_PLL1CSGR</name>
					<displayName>RCC_PLL1CSGR</displayName>
					<description>This register is used to configure the PLL1.It is not recommended to change the content of this register when the PLL1 is enabled (PLLON = ). Refer to Section: Using the PLLs in spread spectrum mode for details. If TZEN = , this register can only be modified in secure mode. Write access to this register is not allowed during the clock restore sequence. See Section: The clock restore sequence description for details.</description>
					<addressOffset>0x90</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>MOD_PER</name>
							<description>MOD_PER</description>
							<bitOffset>0</bitOffset>
							<bitWidth>13</bitWidth>
						</field>
						<field>
							<name>TPDFN_DIS</name>
							<description>TPDFN_DIS</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>RPDFN_DIS</name>
							<description>RPDFN_DIS</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SSCG_MODE</name>
							<description>SSCG_MODE</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>INC_STEP</name>
							<description>INC_STEP</description>
							<bitOffset>16</bitOffset>
							<bitWidth>15</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>RCC_PLL2CR</name>
					<displayName>RCC_PLL2CR</displayName>
					<description>This register is used to control the PLL2. If TZEN = , this register can only be modified in secure mode. Write access to this register is not allowed during the clock restore sequence. See Section: The clock restore sequence description for details.</description>
					<addressOffset>0x94</addressOffset>
					<size>0x20</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>PLLON</name>
							<description>PLLON</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PLL2RDY</name>
							<description>PLL2RDY</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>SSCG_CTRL</name>
							<description>SSCG_CTRL</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>DIVPEN</name>
							<description>DIVPEN</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>DIVQEN</name>
							<description>DIVQEN</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>DIVREN</name>
							<description>DIVREN</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RCC_PLL2CFGR1</name>
					<displayName>RCC_PLL2CFGR1</displayName>
					<description>This register is used to configure the PLL2. If TZEN = , this register can only be modified in secure mode. Write access to this register is not allowed during the clock restore sequence. See Section: The clock restore sequence description for details.</description>
					<addressOffset>0x98</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00010063</resetValue>
					<fields>
						<field>
							<name>DIVN</name>
							<description>DIVN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>9</bitWidth>
						</field>
						<field>
							<name>DIVM2</name>
							<description>DIVM2</description>
							<bitOffset>16</bitOffset>
							<bitWidth>6</bitWidth>
						</field>
					</fields>
				</register>
