henri-32/esp32-tiller-autopilot/.pio-core/platforms/ststm32/misc/svd/STM32MP153x.svd
				<register>
					<name>RCC_PLL2CFGR2</name>
					<displayName>RCC_PLL2CFGR2</displayName>
					<description>This register is used to configure the PLL2. If TZEN = , this register can only be modified in secure mode. Write access to this register is not allowed during the clock restore sequence. See Section: The clock restore sequence description for details.</description>
					<addressOffset>0x9C</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00010101</resetValue>
					<fields>
						<field>
							<name>DIVP</name>
							<description>DIVP</description>
							<bitOffset>0</bitOffset>
							<bitWidth>7</bitWidth>
						</field>
						<field>
							<name>DIVQ</name>
							<description>DIVQ</description>
							<bitOffset>8</bitOffset>
							<bitWidth>7</bitWidth>
						</field>
						<field>
							<name>DIVR</name>
							<description>DIVR</description>
							<bitOffset>16</bitOffset>
							<bitWidth>7</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>RCC_PLL2FRACR</name>
					<displayName>RCC_PLL2FRACR</displayName>
					<description>This register is used to fine-tune the frequency of the PLL2 VCO. If TZEN = , this register can only be modified in secure mode. Write access to this register is not allowed during the clock restore sequence. See Section: The clock restore sequence description for details.</description>
					<addressOffset>0xA0</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>FRACV</name>
							<description>FRACV</description>
							<bitOffset>3</bitOffset>
							<bitWidth>13</bitWidth>
						</field>
						<field>
							<name>FRACLE</name>
							<description>FRACLE</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>RCC_PLL2CSGR</name>
					<displayName>RCC_PLL2CSGR</displayName>
					<description>This register is used to configure the PLL2. It is not recommended to change the content of this register when the PLL2 is enabled (PLLON = ). Refer to Section: Using the PLLs in spread spectrum mode for details. If TZEN = , this register can only be modified in secure mode. Write access to this register is not allowed during the clock restore sequence. See Section: The clock restore sequence description for details.</description>
					<addressOffset>0xA4</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>MOD_PER</name>
							<description>MOD_PER</description>
							<bitOffset>0</bitOffset>
							<bitWidth>13</bitWidth>
						</field>
						<field>
							<name>TPDFN_DIS</name>
							<description>TPDFN_DIS</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>RPDFN_DIS</name>
							<description>RPDFN_DIS</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SSCG_MODE</name>
							<description>SSCG_MODE</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>INC_STEP</name>
							<description>INC_STEP</description>
							<bitOffset>16</bitOffset>
							<bitWidth>15</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>RCC_I2C46CKSELR</name>
					<displayName>RCC_I2C46CKSELR</displayName>
					<description>This register is used to control the selection of the kernel clock for the I2C4 and I2C6. Note that changing the clock source on-the-fly is allowed, and will not generate any timing violation, however the user has to ensure that both the previous and the new clock sources are present during the switching, and for the whole transition time. Refer to Section: Clock enabling delays. If TZEN = , this register can only be modified in secure mode.</description>
					<addressOffset>0xC0</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>I2C46SRC</name>
							<description>I2C46SRC</description>
							<bitOffset>0</bitOffset>
							<bitWidth>3</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>RCC_SPI6CKSELR</name>
					<displayName>RCC_SPI6CKSELR</displayName>
					<description>This register is used to control the selection of the kernel clock for the SPI6. Note that changing the clock source on-the-fly is allowed, and will not generate any timing violation, however the user has to ensure that both the previous and the new clock sources are present during the switching, and for the whole transition time. Refer to Section: Clock enabling delays. If TZEN = , this register can only be modified in secure mode.</description>
					<addressOffset>0xC4</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>SPI6SRC</name>
							<description>SPI6SRC</description>
							<bitOffset>0</bitOffset>
							<bitWidth>3</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>RCC_UART1CKSELR</name>
					<displayName>RCC_UART1CKSELR</displayName>
					<description>This register is used to control the selection of the kernel clock for the USART1. Note that changing the clock source on-the-fly is allowed, and will not generate any timing violation, however the user has to ensure that both the previous and the new clock sources are present during the switching, and for the whole transition time. Refer to Section: Clock enabling delays. If TZEN = , this register can only be modified in secure mode.</description>
					<addressOffset>0xC8</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>UART1SRC</name>
							<description>UART1SRC</description>
							<bitOffset>0</bitOffset>
							<bitWidth>3</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>RCC_RNG1CKSELR</name>
					<displayName>RCC_RNG1CKSELR</displayName>
					<description>This register is used to control the selection of the kernel clock for the RNG1. Note that changing the clock source on-the-fly is allowed, and will not generate any timing violation, however the user has to ensure that both the previous and the new clock sources are present during the switching, and for the whole transition time. Refer to Section: Clock enabling delays. If TZEN = , this register can only be modified in secure mode.</description>
					<addressOffset>0xCC</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>RNG1SRC</name>
							<description>RNG1SRC</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>RCC_CPERCKSELR</name>
					<displayName>RCC_CPERCKSELR</displayName>
					<description>This register is used to select an oscillator source as kernel clock for the per_ck clock. The per_ck clock is distributed to several peripherals. Refer to Section: Clock enabling delays.</description>
					<addressOffset>0xD0</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>CKPERSRC</name>
							<description>CKPERSRC</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>RCC_STGENCKSELR</name>
					<displayName>RCC_STGENCKSELR</displayName>
					<description>This register is used to select the peripheral clock for the STGEN block. Note that this clock is used to provide a time reference for the application. Refer to Section: Clock enabling delays. If TZEN = , this register can only be modified in secure mode.</description>
					<addressOffset>0xD4</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>STGENSRC</name>
							<description>STGENSRC</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>RCC_DDRITFCR</name>
					<displayName>RCC_DDRITFCR</displayName>
					<description>This register is used to control the DDR interface, including the DDRC and DDRPHYC. If TZEN = , this register can only be modified in secure mode.</description>
					<addressOffset>0xD8</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x000FD02A</resetValue>
					<fields>
						<field>
							<name>DDRC1EN</name>
							<description>DDRC1EN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DDRC1LPEN</name>
							<description>DDRC1LPEN</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DDRC2EN</name>
							<description>DDRC2EN</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DDRC2LPEN</name>
							<description>DDRC2LPEN</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DDRPHYCEN</name>
							<description>DDRPHYCEN</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DDRPHYCLPEN</name>
							<description>DDRPHYCLPEN</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DDRCAPBEN</name>
							<description>DDRCAPBEN</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DDRCAPBLPEN</name>
							<description>DDRCAPBLPEN</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>AXIDCGEN</name>
							<description>AXIDCGEN</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DDRPHYCAPBEN</name>
							<description>DDRPHYCAPBEN</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DDRPHYCAPBLPEN</name>
							<description>DDRPHYCAPBLPEN</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>KERDCG_DLY</name>
							<description>KERDCG_DLY</description>
							<bitOffset>11</bitOffset>
							<bitWidth>3</bitWidth>
						</field>
						<field>
							<name>DDRCAPBRST</name>
							<description>DDRCAPBRST</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DDRCAXIRST</name>
							<description>DDRCAXIRST</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DDRCORERST</name>
							<description>DDRCORERST</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DPHYAPBRST</name>
							<description>DPHYAPBRST</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DPHYRST</name>
							<description>DPHYRST</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DPHYCTLRST</name>
							<description>DPHYCTLRST</description>
							<bitOffset>19</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DDRCKMOD</name>
							<description>DDRCKMOD</description>
							<bitOffset>20</bitOffset>
							<bitWidth>3</bitWidth>
						</field>
						<field>
							<name>GSKPMOD</name>
							<description>GSKPMOD</description>
							<bitOffset>23</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>GSKPCTRL</name>
							<description>GSKPCTRL</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DFILP_WIDTH</name>
							<description>DFILP_WIDTH</description>
							<bitOffset>25</bitOffset>
							<bitWidth>3</bitWidth>
						</field>
						<field>
							<name>GSKP_DUR</name>
							<description>GSKP_DUR</description>
							<bitOffset>28</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>RCC_MP_BOOTCR</name>
					<displayName>RCC_MP_BOOTCR</displayName>
					<description>This register is used to control the HOLD boot function when the system exits from Standby. Refer to Section: MCU HOLD_BOOT after processor reset. This register is reset when a system reset occurs, but not when the circuit exits from Standby (app_rst reset).If TZEN = , this register can only be modified in secure mode. This register can only be accessed by the MPU.</description>
					<addressOffset>0x100</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>MCU_BEN</name>
							<description>MCU_BEN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>MPU_BEN</name>
							<description>MPU_BEN</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>RCC_MP_SREQSETR</name>
					<displayName>RCC_MP_SREQSETR</displayName>
					<description>Writing  has no effect, reading will return the values of the bits. Writing a  sets the corresponding bit to . The MCU cannot access to this register. If TZEN = , this register can only be modified in secure mode.</description>
					<addressOffset>0x104</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>STPREQ_P0</name>
							<description>STPREQ_P0</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>STPREQ_P1</name>
							<description>STPREQ_P1</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>RCC_MP_SREQCLRR</name>
					<displayName>RCC_MP_SREQCLRR</displayName>
					<description>Writing  has no effect, reading will return the effective values of the bits. Writing a  sets the corresponding bit to . The MCU cannot access to this register. If TZEN = , this register can only be modified in secure mode.</description>
					<addressOffset>0x108</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>STPREQ_P0</name>
							<description>STPREQ_P0</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>STPREQ_P1</name>
							<description>STPREQ_P1</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>RCC_MP_GCR</name>
					<displayName>RCC_MP_GCR</displayName>
					<description>The register contains global control bits. If TZEN = , this register can only be modified in secure mode.</description>
					<addressOffset>0x10C</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>BOOT_MCU</name>
							<description>BOOT_MCU</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>RCC_MP_APRSTCR</name>
					<displayName>RCC_MP_APRSTCR</displayName>
					<description>This register is used to control the behavior of the warm reset. If TZEN = , this register can only be modified in secure mode.</description>
					<addressOffset>0x110</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00007F00</resetValue>
					<fields>
						<field>
							<name>RDCTLEN</name>
							<description>RDCTLEN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>RSTTO</name>
							<description>RSTTO</description>
							<bitOffset>8</bitOffset>
							<bitWidth>7</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>RCC_MP_APRSTSR</name>
					<displayName>RCC_MP_APRSTSR</displayName>
					<description>This register provides a status of the RDCTL. If TZEN = , this register can only be modified in secure mode.</description>
					<addressOffset>0x114</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>RSTTOV</name>
							<description>RSTTOV</description>
							<bitOffset>8</bitOffset>
							<bitWidth>7</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>RCC_BDCR</name>
					<displayName>RCC_BDCR</displayName>
					<description>This register is used to control the LSE function. Wait states are inserted in case of successive write accesses to this register. The number of wait states may be up to 7 cycles of AHB4 clock.After a system reset, the register RCC_BDCR is write-protected. In order to modify this register, the DBP bit in the PWR control register 1 (PWR_CR1) has to be set to . Bits of RCC_BDCR register are only reset after a backup domain reset: nreset_vsw (see Section10.3.6: Backup domain reset). Any other internal or external reset will not have any effect on these bits.This register is located into the VSW domain. If TZEN = , this register can only be modified in secure mode.</description>
					<addressOffset>0x140</addressOffset>
					<size>0x20</size>
					<resetValue>0x00000020</resetValue>
					<fields>
						<field>
							<name>LSEON</name>
							<description>LSEON</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>LSEBYP</name>
							<description>LSEBYP</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>LSERDY</name>
							<description>LSERDY</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>DIGBYP</name>
							<description>DIGBYP</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>LSEDRV</name>
							<description>LSEDRV</description>
							<bitOffset>4</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>LSECSSON</name>
							<description>LSECSSON</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>LSECSSD</name>
							<description>LSECSSD</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>RTCSRC</name>
							<description>RTCSRC</description>
							<bitOffset>16</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>RTCCKEN</name>
							<description>RTCCKEN</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>VSWRST</name>
							<description>VSWRST</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RCC_RDLSICR</name>
					<displayName>RCC_RDLSICR</displayName>
					<description>This register is used to control the minimum NRST active duration and LSI function.0 to 7 wait states are inserted for word, half-word and byte accesses. Wait states are inserted in case of successive accesses to this register.This register is reset by the por_rst reset, and it is located into the VDD domain. If TZEN = , this register can only be modified in secure mode.</description>
					<addressOffset>0x144</addressOffset>
					<size>0x20</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>LSION</name>
							<description>LSION</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>LSIRDY</name>
							<description>LSIRDY</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>MRD</name>
							<description>MRD</description>
							<bitOffset>16</bitOffset>
							<bitWidth>5</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>EADLY</name>
							<description>EADLY</description>
							<bitOffset>24</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SPARE</name>
							<description>SPARE</description>
							<bitOffset>27</bitOffset>
							<bitWidth>5</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RCC_APB4RSTSETR</name>
					<displayName>RCC_APB4RSTSETR</displayName>
					<description>This register is used to activate the reset of the corresponding peripheral. Writing  has no effect, reading will return the effective values of the corresponding bits. Writing a  activates the reset of the corresponding peripheral.</description>
					<addressOffset>0x180</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>LTDCRST</name>
							<description>LTDCRST</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DSIRST</name>
							<description>DSIRST</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DDRPERFMRST</name>
							<description>DDRPERFMRST</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>USBPHYRST</name>
							<description>USBPHYRST</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
