henri-32/esp32-tiller-autopilot/.pio-core/platforms/ststm32/misc/svd/STM32MP153x.svd
				<register>
					<name>RCC_MCO2CFGR</name>
					<displayName>RCC_MCO2CFGR</displayName>
					<description>This register is used to select the clock generated on MCO2 output.</description>
					<addressOffset>0x804</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>MCO2SEL</name>
							<description>MCO2SEL</description>
							<bitOffset>0</bitOffset>
							<bitWidth>3</bitWidth>
						</field>
						<field>
							<name>MCO2DIV</name>
							<description>MCO2DIV</description>
							<bitOffset>4</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>MCO2ON</name>
							<description>MCO2ON</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>RCC_OCRDYR</name>
					<displayName>RCC_OCRDYR</displayName>
					<description>This is a read-only access register, It contains the status flags of oscillators. Writing has no effect.</description>
					<addressOffset>0x808</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>HSIRDY</name>
							<description>HSIRDY</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>HSIDIVRDY</name>
							<description>HSIDIVRDY</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CSIRDY</name>
							<description>CSIRDY</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>HSERDY</name>
							<description>HSERDY</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>MPUCKRDY</name>
							<description>MPUCKRDY</description>
							<bitOffset>23</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>AXICKRDY</name>
							<description>AXICKRDY</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CKREST</name>
							<description>CKREST</description>
							<bitOffset>25</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>RCC_DBGCFGR</name>
					<displayName>RCC_DBGCFGR</displayName>
					<description>This is register contains the enable control of the debug and trace function, and the clock divider for the trace function.</description>
					<addressOffset>0x80C</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000001</resetValue>
					<fields>
						<field>
							<name>TRACEDIV</name>
							<description>TRACEDIV</description>
							<bitOffset>0</bitOffset>
							<bitWidth>3</bitWidth>
						</field>
						<field>
							<name>DBGCKEN</name>
							<description>DBGCKEN</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TRACECKEN</name>
							<description>TRACECKEN</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DBGRST</name>
							<description>DBGRST</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>RCC_RCK3SELR</name>
					<displayName>RCC_RCK3SELR</displayName>
					<description>This register is used to select the reference clock for PLL3. If TZEN = MCKPROT = , this register can only be modified in secure mode.</description>
					<addressOffset>0x820</addressOffset>
					<size>0x20</size>
					<resetValue>0x80000000</resetValue>
					<fields>
						<field>
							<name>PLL3SRC</name>
							<description>PLL3SRC</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PLL3SRCRDY</name>
							<description>PLL3SRCRDY</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RCC_RCK4SELR</name>
					<displayName>RCC_RCK4SELR</displayName>
					<description>This register is used to select the reference clock for PLL4.</description>
					<addressOffset>0x824</addressOffset>
					<size>0x20</size>
					<resetValue>0x80000000</resetValue>
					<fields>
						<field>
							<name>PLL4SRC</name>
							<description>PLL4SRC</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PLL4SRCRDY</name>
							<description>PLL4SRCRDY</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RCC_TIMG1PRER</name>
					<displayName>RCC_TIMG1PRER</displayName>
					<description>This register is used to control the prescaler value of timers located into APB1 domain. It concerns TIM2, TIM3, TIM4, TIM5, TIM6, TIM7, TIM12, TIM13 and TIM14. Refer to Section: Sub-system clock generation for additional information.</description>
					<addressOffset>0x828</addressOffset>
					<size>0x20</size>
					<resetValue>0x80000000</resetValue>
					<fields>
						<field>
							<name>TIMG1PRE</name>
							<description>TIMG1PRE</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TIMG1PRERDY</name>
							<description>TIMG1PRERDY</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RCC_TIMG2PRER</name>
					<displayName>RCC_TIMG2PRER</displayName>
					<description>This register is used to control the prescaler value of timers located into APB2 domain. It concerns TIM1, TIM8, TIM15, TIM16, and TIM17. Refer to Section: Sub-system clock generation for additional information.</description>
					<addressOffset>0x82C</addressOffset>
					<size>0x20</size>
					<resetValue>0x80000000</resetValue>
					<fields>
						<field>
							<name>TIMG2PRE</name>
							<description>TIMG2PRE</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TIMG2PRERDY</name>
							<description>TIMG2PRERDY</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RCC_MCUDIVR</name>
					<displayName>RCC_MCUDIVR</displayName>
					<description>This register is used to control the MCU sub-system clock prescaler. Refer to Section: Sub-system clock generation for additional information. If TZEN = , this register can only be modified in secure mode.</description>
					<addressOffset>0x830</addressOffset>
					<size>0x20</size>
					<resetValue>0x80000000</resetValue>
					<fields>
						<field>
							<name>MCUDIV</name>
							<description>MCUDIV</description>
							<bitOffset>0</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MCUDIVRDY</name>
							<description>MCUDIVRDY</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RCC_APB1DIVR</name>
					<displayName>RCC_APB1DIVR</displayName>
					<description>This register is used to control the APB1 clock prescaler. Refer to section Section1.4.6.3: Sub-System Clock Generation for additional information.</description>
					<addressOffset>0x834</addressOffset>
					<size>0x20</size>
					<resetValue>0x80000000</resetValue>
					<fields>
						<field>
							<name>APB1DIV</name>
							<description>APB1DIV</description>
							<bitOffset>0</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>APB1DIVRDY</name>
							<description>APB1DIVRDY</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RCC_APB2DIVR</name>
					<displayName>RCC_APB2DIVR</displayName>
					<description>This register is used to control the APB2 clock prescaler. Refer to Section: Sub-system clock generation for additional information.</description>
					<addressOffset>0x838</addressOffset>
					<size>0x20</size>
					<resetValue>0x80000000</resetValue>
					<fields>
						<field>
							<name>APB2DIV</name>
							<description>APB2DIV</description>
							<bitOffset>0</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>APB2DIVRDY</name>
							<description>APB2DIVRDY</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RCC_APB3DIVR</name>
					<displayName>RCC_APB3DIVR</displayName>
					<description>This register is used to control the APB3 clock prescaler. Refer to Section: Sub-system clock generation for additional information.</description>
					<addressOffset>0x83C</addressOffset>
					<size>0x20</size>
					<resetValue>0x80000000</resetValue>
					<fields>
						<field>
							<name>APB3DIV</name>
							<description>APB3DIV</description>
							<bitOffset>0</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>APB3DIVRDY</name>
							<description>APB3DIVRDY</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RCC_PLL3CR</name>
					<displayName>RCC_PLL3CR</displayName>
					<description>This register is used to control the PLL3. If TZEN = MCKPROT = , this register can only be modified in secure mode.</description>
					<addressOffset>0x880</addressOffset>
					<size>0x20</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>PLLON</name>
							<description>PLLON</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PLL3RDY</name>
							<description>PLL3RDY</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>SSCG_CTRL</name>
							<description>SSCG_CTRL</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>DIVPEN</name>
							<description>DIVPEN</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>DIVQEN</name>
							<description>DIVQEN</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>DIVREN</name>
							<description>DIVREN</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RCC_PLL3CFGR1</name>
					<displayName>RCC_PLL3CFGR1</displayName>
					<description>This register is used to configure the PLL3. If TZEN = MCKPROT = , this register can only be modified in secure mode.</description>
					<addressOffset>0x884</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00010031</resetValue>
					<fields>
						<field>
							<name>DIVN</name>
							<description>DIVN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>9</bitWidth>
						</field>
						<field>
							<name>DIVM3</name>
							<description>DIVM3</description>
							<bitOffset>16</bitOffset>
							<bitWidth>6</bitWidth>
						</field>
						<field>
							<name>IFRGE</name>
							<description>IFRGE</description>
							<bitOffset>24</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>RCC_PLL3CFGR2</name>
					<displayName>RCC_PLL3CFGR2</displayName>
					<description>This register is used to configure the PLL3. If TZEN = MCKPROT = , this register can only be modified in secure mode.</description>
					<addressOffset>0x888</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00010101</resetValue>
					<fields>
						<field>
							<name>DIVP</name>
							<description>DIVP</description>
							<bitOffset>0</bitOffset>
							<bitWidth>7</bitWidth>
						</field>
						<field>
							<name>DIVQ</name>
							<description>DIVQ</description>
							<bitOffset>8</bitOffset>
							<bitWidth>7</bitWidth>
						</field>
						<field>
							<name>DIVR</name>
							<description>DIVR</description>
							<bitOffset>16</bitOffset>
							<bitWidth>7</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>RCC_PLL3FRACR</name>
					<displayName>RCC_PLL3FRACR</displayName>
					<description>This register is used to fine-tune the frequency of the PLL3 VCO. If TZEN = MCKPROT = , this register can only be modified in secure mode.</description>
					<addressOffset>0x88C</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>FRACV</name>
							<description>FRACV</description>
							<bitOffset>3</bitOffset>
							<bitWidth>13</bitWidth>
						</field>
						<field>
							<name>FRACLE</name>
							<description>FRACLE</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>RCC_PLL3CSGR</name>
					<displayName>RCC_PLL3CSGR</displayName>
					<description>This register is used to configure the PLL3.It is not recommended to change the content of this register when the PLL3 is enabled (PLLON = ). Refer to Section: Using the PLLs in spread spectrum mode for details. If TZEN = MCKPROT = , this register can only be modified in secure mode.</description>
					<addressOffset>0x890</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>MOD_PER</name>
							<description>MOD_PER</description>
							<bitOffset>0</bitOffset>
							<bitWidth>13</bitWidth>
						</field>
						<field>
							<name>TPDFN_DIS</name>
							<description>TPDFN_DIS</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>RPDFN_DIS</name>
							<description>RPDFN_DIS</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SSCG_MODE</name>
							<description>SSCG_MODE</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>INC_STEP</name>
							<description>INC_STEP</description>
							<bitOffset>16</bitOffset>
							<bitWidth>15</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>RCC_PLL4CR</name>
					<displayName>RCC_PLL4CR</displayName>
					<description>This register is used to control the PLL4.</description>
					<addressOffset>0x894</addressOffset>
					<size>0x20</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>PLLON</name>
							<description>PLLON</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PLL4RDY</name>
							<description>PLL4RDY</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>SSCG_CTRL</name>
							<description>SSCG_CTRL</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>DIVPEN</name>
							<description>DIVPEN</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>DIVQEN</name>
							<description>DIVQEN</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>DIVREN</name>
							<description>DIVREN</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RCC_PLL4CFGR1</name>
					<displayName>RCC_PLL4CFGR1</displayName>
					<description>This register is used to configure the PLL4.</description>
					<addressOffset>0x898</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00010031</resetValue>
					<fields>
						<field>
							<name>DIVN</name>
							<description>DIVN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>9</bitWidth>
						</field>
						<field>
							<name>DIVM4</name>
							<description>DIVM4</description>
							<bitOffset>16</bitOffset>
							<bitWidth>6</bitWidth>
						</field>
						<field>
							<name>IFRGE</name>
							<description>IFRGE</description>
							<bitOffset>24</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>RCC_PLL4CFGR2</name>
					<displayName>RCC_PLL4CFGR2</displayName>
					<description>This register is used to configure the PLL4.</description>
					<addressOffset>0x89C</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>DIVP</name>
							<description>DIVP</description>
							<bitOffset>0</bitOffset>
							<bitWidth>7</bitWidth>
						</field>
						<field>
							<name>DIVQ</name>
							<description>DIVQ</description>
							<bitOffset>8</bitOffset>
							<bitWidth>7</bitWidth>
						</field>
						<field>
							<name>DIVR</name>
							<description>DIVR</description>
							<bitOffset>16</bitOffset>
							<bitWidth>7</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>RCC_PLL4FRACR</name>
					<displayName>RCC_PLL4FRACR</displayName>
					<description>This register is used to fine-tune the frequency of the PLL4 VCO.</description>
					<addressOffset>0x8A0</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>FRACV</name>
							<description>FRACV</description>
							<bitOffset>3</bitOffset>
							<bitWidth>13</bitWidth>
						</field>
						<field>
							<name>FRACLE</name>
							<description>FRACLE</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>RCC_PLL4CSGR</name>
					<displayName>RCC_PLL4CSGR</displayName>
					<description>This register is used to configure the PLL4.It is not recommended to change the content of this register when the PLL4 is enabled (PLLON = ). Refer to Section: Using the PLLs in spread spectrum mode for details. If TZEN = MCKPROT = , this register can only be modified in secure mode.</description>
					<addressOffset>0x8A4</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>MOD_PER</name>
							<description>MOD_PER</description>
							<bitOffset>0</bitOffset>
							<bitWidth>13</bitWidth>
						</field>
						<field>
							<name>TPDFN_DIS</name>
							<description>TPDFN_DIS</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>RPDFN_DIS</name>
							<description>RPDFN_DIS</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SSCG_MODE</name>
							<description>SSCG_MODE</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>INC_STEP</name>
							<description>INC_STEP</description>
							<bitOffset>16</bitOffset>
							<bitWidth>15</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>RCC_I2C12CKSELR</name>
					<displayName>RCC_I2C12CKSELR</displayName>
					<description>This register is used to control the selection of the kernel clock for the I2C1 and I2C2. Note that changing the clock source on-the-fly is allowed, and will not generate any timing violation, however the user has to ensure that both the previous and the new clock sources are present during the switching, and for the whole transition time. Refer to Section: Clock enabling delays.</description>
					<addressOffset>0x8C0</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>I2C12SRC</name>
							<description>I2C12SRC</description>
							<bitOffset>0</bitOffset>
							<bitWidth>3</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>RCC_I2C35CKSELR</name>
					<displayName>RCC_I2C35CKSELR</displayName>
					<description>This register is used to control the selection of the kernel clock for the I2C3 and I2C5. Note that changing the clock source on-the-fly is allowed, and will not generate any timing violation, however the user has to ensure that both the previous and the new clock sources are present during the switching, and for the whole transition time. Refer to Section: Clock enabling delays.</description>
					<addressOffset>0x8C4</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>I2C35SRC</name>
							<description>I2C35SRC</description>
							<bitOffset>0</bitOffset>
							<bitWidth>3</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>RCC_SAI1CKSELR</name>
					<displayName>RCC_SAI1CKSELR</displayName>
					<description>This register is used to control the selection of the kernel clock for the SAI1 and DFSDM audio clock. Note that changing the clock source on-the-fly is allowed, and will not generate any timing violation, however the user has to ensure that both the previous and the new clock sources are present during the switching, and for the whole transition time. Refer to Section: Clock enabling delays.</description>
					<addressOffset>0x8C8</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>SAI1SRC</name>
							<description>SAI1SRC</description>
							<bitOffset>0</bitOffset>
							<bitWidth>3</bitWidth>
						</field>
					</fields>
				</register>
