henri-32/esp32-tiller-autopilot/.pio-core/platforms/ststm32/misc/svd/STM32MP153x.svd
			</registers>
	</peripheral>
	<peripheral>
			<name>IPCC</name>
			<description>IPCC</description>
			<groupName>IPCC</groupName>
			<baseAddress>0x4C001000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x400</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<register>
					<name>IPCC_C1CR</name>
					<displayName>IPCC_C1CR</displayName>
					<description>IPCC Processor 1 control register</description>
					<addressOffset>0x0</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>RXOIE</name>
							<description>RXOIE</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TXFIE</name>
							<description>TXFIE</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>IPCC_C1MR</name>
					<displayName>IPCC_C1MR</displayName>
					<description>IPCC Processor 1 mask register</description>
					<addressOffset>0x4</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0xFFFFFFFF</resetValue>
					<fields>
						<field>
							<name>CHxOM</name>
							<description>CHxOM</description>
							<bitOffset>0</bitOffset>
							<bitWidth>6</bitWidth>
						</field>
						<field>
							<name>CHxFM</name>
							<description>CHxFM</description>
							<bitOffset>16</bitOffset>
							<bitWidth>6</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>IPCC_C1SCR</name>
					<displayName>IPCC_C1SCR</displayName>
					<description>Reading this register will always return 0x0000 0000.</description>
					<addressOffset>0x8</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>CHxC</name>
							<description>CHxC</description>
							<bitOffset>0</bitOffset>
							<bitWidth>6</bitWidth>
						</field>
						<field>
							<name>CHxS</name>
							<description>CHxS</description>
							<bitOffset>16</bitOffset>
							<bitWidth>6</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>IPCC_C1TOC2SR</name>
					<displayName>IPCC_C1TOC2SR</displayName>
					<description>IPCC processor 1 to processor 2 status register</description>
					<addressOffset>0xC</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>CHxF</name>
							<description>CHxF</description>
							<bitOffset>0</bitOffset>
							<bitWidth>6</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>IPCC_C2CR</name>
					<displayName>IPCC_C2CR</displayName>
					<description>IPCC Processor 2 control register</description>
					<addressOffset>0x10</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>RXOIE</name>
							<description>RXOIE</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TXFIE</name>
							<description>TXFIE</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>IPCC_C2MR</name>
					<displayName>IPCC_C2MR</displayName>
					<description>IPCC Processor 2 mask register</description>
					<addressOffset>0x14</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0xFFFFFFFF</resetValue>
					<fields>
						<field>
							<name>CHxOM</name>
							<description>CHxOM</description>
							<bitOffset>0</bitOffset>
							<bitWidth>6</bitWidth>
						</field>
						<field>
							<name>CHxFM</name>
							<description>CHxFM</description>
							<bitOffset>16</bitOffset>
							<bitWidth>6</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>IPCC_C2SCR</name>
					<displayName>IPCC_C2SCR</displayName>
					<description>Reading this register will always return 0x0000 0000.</description>
					<addressOffset>0x18</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>CHxC</name>
							<description>CHxC</description>
							<bitOffset>0</bitOffset>
							<bitWidth>6</bitWidth>
						</field>
						<field>
							<name>CHxS</name>
							<description>CHxS</description>
							<bitOffset>16</bitOffset>
							<bitWidth>6</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>IPCC_C2TOC1SR</name>
					<displayName>IPCC_C2TOC1SR</displayName>
					<description>IPCC processor 2 to processor 1 status register</description>
					<addressOffset>0x1C</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>CHxF</name>
							<description>CHxF</description>
							<bitOffset>0</bitOffset>
							<bitWidth>6</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>IPCC_HWCFGR</name>
					<displayName>IPCC_HWCFGR</displayName>
					<description>IPCC Hardware configuration register</description>
					<addressOffset>0x3F0</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000002</resetValue>
					<fields>
						<field>
							<name>CHANNELS</name>
							<description>CHANNELS</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>IPCC_VER</name>
					<displayName>IPCC_VER</displayName>
					<description>IPCC IP Version register</description>
					<addressOffset>0x3F4</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000010</resetValue>
					<fields>
						<field>
							<name>MINREV</name>
							<description>MINREV</description>
							<bitOffset>0</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>MAJREV</name>
							<description>MAJREV</description>
							<bitOffset>4</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>IPCC_ID</name>
					<displayName>IPCC_ID</displayName>
					<description>IPCC IP Identification register</description>
					<addressOffset>0x3F8</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00100071</resetValue>
					<fields>
						<field>
							<name>IPID</name>
							<description>IPID</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>IPCC_SID</name>
					<displayName>IPCC_SID</displayName>
					<description>IPCC Size ID register</description>
					<addressOffset>0x3FC</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0xA3C5DD01</resetValue>
					<fields>
						<field>
							<name>SID</name>
							<description>SID</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
						</field>
					</fields>
				</register>
