henri-32/esp32-tiller-autopilot/.pio-core/platforms/ststm32/misc/svd/STM32MP153x.svd
				<register>
					<name>OTG_DOEPCTL2</name>
					<displayName>OTG_DOEPCTL2</displayName>
					<description>The application uses this register to control the behavior of each logical endpoint other than endpoint 0.</description>
					<addressOffset>0xB40</addressOffset>
					<size>0x20</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>MPSIZ</name>
							<description>MPSIZ</description>
							<bitOffset>0</bitOffset>
							<bitWidth>11</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>USBAEP</name>
							<description>USBAEP</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>EONUM_DPIP</name>
							<description>EONUM_DPIP</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>NAKSTS</name>
							<description>NAKSTS</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>EPTYP</name>
							<description>EPTYP</description>
							<bitOffset>18</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SNPM</name>
							<description>SNPM</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>STALL</name>
							<description>STALL</description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CNAK</name>
							<description>CNAK</description>
							<bitOffset>26</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>SNAK</name>
							<description>SNAK</description>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>SD0PID_SEVNFRM</name>
							<description>SD0PID_SEVNFRM</description>
							<bitOffset>28</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>SD1PID_SODDFRM</name>
							<description>SD1PID_SODDFRM</description>
							<bitOffset>29</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>EPDIS</name>
							<description>EPDIS</description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>EPENA</name>
							<description>EPENA</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>OTG_DOEPINT2</name>
					<displayName>OTG_DOEPINT2</displayName>
					<description>This register indicates the status of an endpoint with respect to USB- and AHB-related events. It is shown in Figure724. The application must read this register when the OUT endpoints interrupt bit of the OTG_GINTSTS register (OEPINT bit in OTG_GINTSTS) is set. Before the application can read this register, it must first read the OTG_DAINT register to get the exact endpoint number for the OTG_DOEPINTx register. The application must clear the appropriate bit in this register to clear the corresponding bits in the OTG_DAINT and OTG_GINTSTS registers.</description>
					<addressOffset>0xB48</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000080</resetValue>
					<fields>
						<field>
							<name>XFRC</name>
							<description>XFRC</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>EPDISD</name>
							<description>EPDISD</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>AHBERR</name>
							<description>AHBERR</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>STUP</name>
							<description>STUP</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>OTEPDIS</name>
							<description>OTEPDIS</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>STSPHSRX</name>
							<description>STSPHSRX</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>B2BSTUP</name>
							<description>B2BSTUP</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>OUTPKTERR</name>
							<description>OUTPKTERR</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>BNA</name>
							<description>BNA</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>BERR</name>
							<description>BERR</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>NAK</name>
							<description>NAK</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>NYET</name>
							<description>NYET</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>STPKTRX</name>
							<description>STPKTRX</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>OTG_DOEPTSIZ2</name>
					<displayName>OTG_DOEPTSIZ2</displayName>
					<description>The application must modify this register before enabling the endpoint. Once the endpoint is enabled using endpoint enable bit of the OTG_DOEPCTLx registers (EPENA bit in OTG_DOEPCTLx), the core modifies this register. The application can only read this register once the core has cleared the endpoint enable bit.</description>
					<addressOffset>0xB50</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>XFRSIZ</name>
							<description>XFRSIZ</description>
							<bitOffset>0</bitOffset>
							<bitWidth>19</bitWidth>
						</field>
						<field>
							<name>PKTCNT</name>
							<description>PKTCNT</description>
							<bitOffset>19</bitOffset>
							<bitWidth>10</bitWidth>
						</field>
						<field>
							<name>RXDPID_STUPCNT</name>
							<description>RXDPID_STUPCNT</description>
							<bitOffset>29</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>OTG_DOEPDMA2</name>
					<displayName>OTG_DOEPDMA2</displayName>
					<description>OTG device OUT endpoint 2 DMA address register</description>
					<addressOffset>0xB54</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>DMAADDR</name>
							<description>DMAADDR</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>OTG_DOEPCTL3</name>
					<displayName>OTG_DOEPCTL3</displayName>
					<description>The application uses this register to control the behavior of each logical endpoint other than endpoint 0.</description>
					<addressOffset>0xB60</addressOffset>
					<size>0x20</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>MPSIZ</name>
							<description>MPSIZ</description>
							<bitOffset>0</bitOffset>
							<bitWidth>11</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>USBAEP</name>
							<description>USBAEP</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>EONUM_DPIP</name>
							<description>EONUM_DPIP</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>NAKSTS</name>
							<description>NAKSTS</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>EPTYP</name>
							<description>EPTYP</description>
							<bitOffset>18</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SNPM</name>
							<description>SNPM</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>STALL</name>
							<description>STALL</description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CNAK</name>
							<description>CNAK</description>
							<bitOffset>26</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>SNAK</name>
							<description>SNAK</description>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>SD0PID_SEVNFRM</name>
							<description>SD0PID_SEVNFRM</description>
							<bitOffset>28</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>SD1PID_SODDFRM</name>
							<description>SD1PID_SODDFRM</description>
							<bitOffset>29</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>EPDIS</name>
							<description>EPDIS</description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>EPENA</name>
							<description>EPENA</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>OTG_DOEPINT3</name>
					<displayName>OTG_DOEPINT3</displayName>
					<description>This register indicates the status of an endpoint with respect to USB- and AHB-related events. It is shown in Figure724. The application must read this register when the OUT endpoints interrupt bit of the OTG_GINTSTS register (OEPINT bit in OTG_GINTSTS) is set. Before the application can read this register, it must first read the OTG_DAINT register to get the exact endpoint number for the OTG_DOEPINTx register. The application must clear the appropriate bit in this register to clear the corresponding bits in the OTG_DAINT and OTG_GINTSTS registers.</description>
					<addressOffset>0xB68</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000080</resetValue>
					<fields>
						<field>
							<name>XFRC</name>
							<description>XFRC</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>EPDISD</name>
							<description>EPDISD</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>AHBERR</name>
							<description>AHBERR</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>STUP</name>
							<description>STUP</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>OTEPDIS</name>
							<description>OTEPDIS</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>STSPHSRX</name>
							<description>STSPHSRX</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>B2BSTUP</name>
							<description>B2BSTUP</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>OUTPKTERR</name>
							<description>OUTPKTERR</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>BNA</name>
							<description>BNA</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>BERR</name>
							<description>BERR</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>NAK</name>
							<description>NAK</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>NYET</name>
							<description>NYET</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>STPKTRX</name>
							<description>STPKTRX</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>OTG_DOEPTSIZ3</name>
					<displayName>OTG_DOEPTSIZ3</displayName>
					<description>The application must modify this register before enabling the endpoint. Once the endpoint is enabled using endpoint enable bit of the OTG_DOEPCTLx registers (EPENA bit in OTG_DOEPCTLx), the core modifies this register. The application can only read this register once the core has cleared the endpoint enable bit.</description>
					<addressOffset>0xB70</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>XFRSIZ</name>
							<description>XFRSIZ</description>
							<bitOffset>0</bitOffset>
							<bitWidth>19</bitWidth>
						</field>
						<field>
							<name>PKTCNT</name>
							<description>PKTCNT</description>
							<bitOffset>19</bitOffset>
							<bitWidth>10</bitWidth>
						</field>
						<field>
							<name>RXDPID_STUPCNT</name>
							<description>RXDPID_STUPCNT</description>
							<bitOffset>29</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>OTG_DOEPDMA3</name>
					<displayName>OTG_DOEPDMA3</displayName>
					<description>OTG device OUT endpoint 3 DMA address register</description>
					<addressOffset>0xB74</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>DMAADDR</name>
							<description>DMAADDR</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>OTG_DOEPCTL4</name>
					<displayName>OTG_DOEPCTL4</displayName>
					<description>The application uses this register to control the behavior of each logical endpoint other than endpoint 0.</description>
					<addressOffset>0xB80</addressOffset>
					<size>0x20</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>MPSIZ</name>
							<description>MPSIZ</description>
							<bitOffset>0</bitOffset>
							<bitWidth>11</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>USBAEP</name>
							<description>USBAEP</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>EONUM_DPIP</name>
							<description>EONUM_DPIP</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>NAKSTS</name>
							<description>NAKSTS</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>EPTYP</name>
							<description>EPTYP</description>
							<bitOffset>18</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SNPM</name>
							<description>SNPM</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>STALL</name>
							<description>STALL</description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CNAK</name>
							<description>CNAK</description>
							<bitOffset>26</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>SNAK</name>
							<description>SNAK</description>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>SD0PID_SEVNFRM</name>
							<description>SD0PID_SEVNFRM</description>
							<bitOffset>28</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>SD1PID_SODDFRM</name>
							<description>SD1PID_SODDFRM</description>
							<bitOffset>29</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>EPDIS</name>
							<description>EPDIS</description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>EPENA</name>
							<description>EPENA</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>OTG_DOEPINT4</name>
					<displayName>OTG_DOEPINT4</displayName>
					<description>This register indicates the status of an endpoint with respect to USB- and AHB-related events. It is shown in Figure724. The application must read this register when the OUT endpoints interrupt bit of the OTG_GINTSTS register (OEPINT bit in OTG_GINTSTS) is set. Before the application can read this register, it must first read the OTG_DAINT register to get the exact endpoint number for the OTG_DOEPINTx register. The application must clear the appropriate bit in this register to clear the corresponding bits in the OTG_DAINT and OTG_GINTSTS registers.</description>
					<addressOffset>0xB88</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000080</resetValue>
					<fields>
						<field>
							<name>XFRC</name>
							<description>XFRC</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>EPDISD</name>
							<description>EPDISD</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>AHBERR</name>
							<description>AHBERR</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>STUP</name>
							<description>STUP</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>OTEPDIS</name>
							<description>OTEPDIS</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>STSPHSRX</name>
							<description>STSPHSRX</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>B2BSTUP</name>
							<description>B2BSTUP</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>OUTPKTERR</name>
							<description>OUTPKTERR</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>BNA</name>
							<description>BNA</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>BERR</name>
							<description>BERR</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>NAK</name>
							<description>NAK</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>NYET</name>
							<description>NYET</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>STPKTRX</name>
							<description>STPKTRX</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>OTG_DOEPTSIZ4</name>
					<displayName>OTG_DOEPTSIZ4</displayName>
					<description>The application must modify this register before enabling the endpoint. Once the endpoint is enabled using endpoint enable bit of the OTG_DOEPCTLx registers (EPENA bit in OTG_DOEPCTLx), the core modifies this register. The application can only read this register once the core has cleared the endpoint enable bit.</description>
					<addressOffset>0xB90</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>XFRSIZ</name>
							<description>XFRSIZ</description>
							<bitOffset>0</bitOffset>
							<bitWidth>19</bitWidth>
						</field>
						<field>
							<name>PKTCNT</name>
							<description>PKTCNT</description>
							<bitOffset>19</bitOffset>
							<bitWidth>10</bitWidth>
						</field>
						<field>
							<name>RXDPID_STUPCNT</name>
							<description>RXDPID_STUPCNT</description>
							<bitOffset>29</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>OTG_DOEPDMA4</name>
					<displayName>OTG_DOEPDMA4</displayName>
					<description>OTG device OUT endpoint 4 DMA address register</description>
					<addressOffset>0xB94</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>DMAADDR</name>
							<description>DMAADDR</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
						</field>
					</fields>
				</register>
