henri-32/esp32-tiller-autopilot/.pio-core/platforms/ststm32/misc/svd/STM32MP153x.svd
      </registers>
    </peripheral>
	 <peripheral>
      <name>WWDG1</name>
      <description>WWDG1</description>
      <groupName>WWDG1</groupName>
      <baseAddress>0x4000A000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
	   <interrupt>
        <name>WWDG1_IT</name>
        <description>Window Watchdog interrupt</description>
        <value>0</value>
      </interrupt>
      <registers>
        <register>
          <name>WWDG_CR</name>
          <displayName>WWDG_CR</displayName>
          <description>Control register</description>
          <addressOffset>0x00</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000007F</resetValue>
          <fields>
            <field>
              <name>T</name>
              <description>T</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WDGA</name>
              <description>WDGA</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WWDG_CFR</name>
          <displayName>WWDG_CFR</displayName>
          <description>Configuration register</description>
          <addressOffset>0x04</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000007F</resetValue>
          <fields>
            <field>
              <name>W</name>
              <description>W</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EWI</name>
              <description>EWI</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WDGTB</name>
              <description>WDGTB</description>
              <bitOffset>11</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WWDG_SR</name>
          <displayName>WWDG_SR</displayName>
          <description>Status register</description>
          <addressOffset>0x08</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>EWIF</name>
              <description>EWIF</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WWDG_HWCFGR</name>
          <displayName>WWDG_HWCFGR</displayName>
          <description>WWDG hardware configuration register</description>
          <addressOffset>0x3F0</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000FFF</resetValue>
          <fields>
            <field>
              <name>PREDIV</name>
              <description>PREDIV</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WWDG_VERR</name>
          <displayName>WWDG_VERR</displayName>
          <description>WWDG version register</description>
          <addressOffset>0x3F4</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000021</resetValue>
          <fields>
            <field>
              <name>MINREV</name>
              <description>MINREV</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MAJREV</name>
              <description>MAJREV</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WWDG_IPIDR</name>
          <displayName>WWDG_IPIDR</displayName>
          <description>WWDG ID register</description>
          <addressOffset>0x3F8</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00120051</resetValue>
          <fields>
            <field>
              <name>ID</name>
              <description>ID</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WWDG_SIDR</name>
          <displayName>WWDG_SIDR</displayName>
          <description>WWDG size ID register</description>
          <addressOffset>0x3FC</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0xA3C5DD01</resetValue>
          <fields>
            <field>
              <name>SID</name>
              <description>SID</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>AXIMC_Mx</name>
      <description>AXIMC_Mx</description>
      <groupName>AXIMC_Mx</groupName>
      <baseAddress>0x57042024</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x100000</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>AXIMC_M0_FN_MOD2</name>
          <displayName>AXIMC_M0_FN_MOD2</displayName>
          <description>AXIMC master 0 packing functionality register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BYPASS_MERGE</name>
              <description>BYPASS_MERGE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AXIMC_M0_READ_QOS</name>
          <displayName>AXIMC_M0_READ_QOS</displayName>
          <description>AXIMC master 0 read priority register</description>
          <addressOffset>0xDC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000006</resetValue>
          <fields>
            <field>
              <name>AR_QOS</name>
              <description>AR_QOS</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AXIMC_M0_WRITE_QOS</name>
          <displayName>AXIMC_M0_WRITE_QOS</displayName>
          <description>AXIMC master 0 write priority register</description>
          <addressOffset>0xE4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000006</resetValue>
          <fields>
            <field>
              <name>AW_QOS</name>
              <description>AW_QOS</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AXIMC_M0_FN_MOD</name>
          <displayName>AXIMC_M0_FN_MOD</displayName>
          <description>AXIMC master 0 issuing capability override functionality register</description>
          <addressOffset>0xE0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>READ_ISS_OVERRIDE</name>
              <description>READ_ISS_OVERRIDE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_ISS_OVERRIDE</name>
              <description>WRITE_ISS_OVERRIDE</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AXIMC_M1_FN_MOD2</name>
          <displayName>AXIMC_M1_FN_MOD2</displayName>
          <description>AXIMC master 1 packing functionality register</description>
          <addressOffset>0x1000</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BYPASS_MERGE</name>
              <description>BYPASS_MERGE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AXIMC_M1_READ_QOS</name>
          <displayName>AXIMC_M1_READ_QOS</displayName>
          <description>AXIMC master 1 read priority register</description>
          <addressOffset>0x10DC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000006</resetValue>
          <fields>
            <field>
              <name>AR_QOS</name>
              <description>AR_QOS</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AXIMC_M1_WRITE_QOS</name>
          <displayName>AXIMC_M1_WRITE_QOS</displayName>
          <description>AXIMC master 1 write priority register</description>
          <addressOffset>0x10E0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000006</resetValue>
          <fields>
            <field>
              <name>AW_QOS</name>
              <description>AW_QOS</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AXIMC_M1_FN_MOD</name>
          <displayName>AXIMC_M1_FN_MOD</displayName>
          <description>AXIMC master 1 issuing capability override functionality register</description>
          <addressOffset>0x10E4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>READ_ISS_OVERRIDE</name>
              <description>READ_ISS_OVERRIDE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_ISS_OVERRIDE</name>
              <description>WRITE_ISS_OVERRIDE</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AXIMC_M2_FN_MOD2</name>
          <displayName>AXIMC_M2_FN_MOD2</displayName>
          <description>AXIMC master 2 packing functionality register</description>
          <addressOffset>0x2000</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BYPASS_MERGE</name>
              <description>BYPASS_MERGE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AXIMC_M2_READ_QOS</name>
          <displayName>AXIMC_M2_READ_QOS</displayName>
          <description>AXIMC master 2 read priority register</description>
          <addressOffset>0x20DC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000006</resetValue>
          <fields>
            <field>
              <name>AR_QOS</name>
              <description>AR_QOS</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AXIMC_M2_WRITE_QOS</name>
          <displayName>AXIMC_M2_WRITE_QOS</displayName>
          <description>AXIMC master 2 write priority register</description>
          <addressOffset>0x20E0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000006</resetValue>
          <fields>
            <field>
              <name>AW_QOS</name>
              <description>AW_QOS</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AXIMC_M2_FN_MOD</name>
          <displayName>AXIMC_M2_FN_MOD</displayName>
          <description>AXIMC master 2 issuing capability override functionality register</description>
          <addressOffset>0x20E4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>READ_ISS_OVERRIDE</name>
              <description>READ_ISS_OVERRIDE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_ISS_OVERRIDE</name>
              <description>WRITE_ISS_OVERRIDE</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AXIMC_M5_FN_MOD2</name>
          <displayName>AXIMC_M5_FN_MOD2</displayName>
          <description>AXIMC master 5 packing functionality register</description>
          <addressOffset>0x3000</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BYPASS_MERGE</name>
              <description>BYPASS_MERGE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AXIMC_M5_READ_QOS</name>
          <displayName>AXIMC_M5_READ_QOS</displayName>
          <description>AXIMC master 5 read priority register</description>
          <addressOffset>0x30DC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000004</resetValue>
          <fields>
            <field>
              <name>AR_QOS</name>
              <description>AR_QOS</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AXIMC_M5_WRITE_QOS</name>
          <displayName>AXIMC_M5_WRITE_QOS</displayName>
          <description>AXIMC master 5 write priority register</description>
          <addressOffset>0x30E0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000004</resetValue>
          <fields>
            <field>
              <name>AW_QOS</name>
              <description>AW_QOS</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AXIMC_M5_FN_MOD</name>
          <displayName>AXIMC_M5_FN_MOD</displayName>
          <description>AXIMC master 5 issuing capability override functionality register</description>
          <addressOffset>0x30E4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>READ_ISS_OVERRIDE</name>
              <description>READ_ISS_OVERRIDE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_ISS_OVERRIDE</name>
              <description>WRITE_ISS_OVERRIDE</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AXIMC_M3_READ_QOS</name>
          <displayName>AXIMC_M3_READ_QOS</displayName>
          <description>AXIMC master 3 read priority register</description>
          <addressOffset>0x40DC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000007</resetValue>
          <fields>
            <field>
              <name>AR_QOS</name>
              <description>AR_QOS</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AXIMC_M3_WRITE_QOS</name>
          <displayName>AXIMC_M3_WRITE_QOS</displayName>
          <description>AXIMC master 3 write priority register</description>
          <addressOffset>0x40E0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000007</resetValue>
          <fields>
            <field>
              <name>AW_QOS</name>
              <description>AW_QOS</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AXIMC_M3_FN_MOD</name>
          <displayName>AXIMC_M3_FN_MOD</displayName>
          <description>AXIMC master 3 packing functionality register</description>
          <addressOffset>0x40E4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>READ_ISS_OVERRIDE</name>
              <description>READ_ISS_OVERRIDE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_ISS_OVERRIDE</name>
              <description>WRITE_ISS_OVERRIDE</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AXIMC_M7_READ_QOS</name>
          <displayName>AXIMC_M7_READ_QOS</displayName>
          <description>AXIMC master 7 read priority register</description>
          <addressOffset>0x50DC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000008</resetValue>
          <fields>
            <field>
              <name>AR_QOS</name>
              <description>AR_QOS</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AXIMC_M7_WRITE_QOS</name>
          <displayName>AXIMC_M7_WRITE_QOS</displayName>
          <description>AXIMC master 7 write priority register</description>
          <addressOffset>0x50E0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000008</resetValue>
          <fields>
            <field>
              <name>AW_QOS</name>
              <description>AW_QOS</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AXIMC_M7_FN_MOD</name>
          <displayName>AXIMC_M7_FN_MOD</displayName>
          <description>AXIMC master 7 issuing capability override functionality register</description>
          <addressOffset>0x50E4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>READ_ISS_OVERRIDE</name>
              <description>READ_ISS_OVERRIDE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_ISS_OVERRIDE</name>
              <description>WRITE_ISS_OVERRIDE</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AXIMC_M8_READ_QOS</name>
          <displayName>AXIMC_M8_READ_QOS</displayName>
          <description>AXIMC master 8 read priority register</description>
          <addressOffset>0x60DC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000008</resetValue>
          <fields>
            <field>
              <name>AR_QOS</name>
              <description>AR_QOS</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AXIMC_M8_WRITE_QOS</name>
          <displayName>AXIMC_M8_WRITE_QOS</displayName>
          <description>AXIMC master 8 write priority register</description>
          <addressOffset>0x60E0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000008</resetValue>
          <fields>
            <field>
              <name>AW_QOS</name>
              <description>AW_QOS</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
